*** toml-pretty-deser-macros/src/lib.rs:135:5: replace is_option_type -> bool with true

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ replace is_option_type -> bool with true
@@ -127,26 +127,17 @@
             }
             None
         }
         _ => None,
     }
 }
 
 fn is_option_type(ty: &Type) -> bool {
-    match ty {
-        Type::Path(TypePath { path, .. }) => {
-            if let Some(segment) = path.segments.last() {
-                segment.ident == "Option"
-            } else {
-                false
-            }
-        }
-        _ => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn extract_vec_inner_type(ty: &Type) -> Option<syn::Ident> {
     // Check if this is a Vec<T> type
     match ty {
         Type::Path(TypePath { path, .. }) => {
             // Check if the path ends with "Vec"
             if let Some(segment) = path.segments.last() {

*** result: Success
