*** toml-pretty-deser-macros/src/lib.rs:136:9: delete match arm Type::Path(TypePath{path, ..}) in is_option_type

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ delete match arm Type::Path(TypePath{path, ..}) in is_option_type
@@ -128,23 +128,17 @@
             None
         }
         _ => None,
     }
 }
 
 fn is_option_type(ty: &Type) -> bool {
     match ty {
-        Type::Path(TypePath { path, .. }) => {
-            if let Some(segment) = path.segments.last() {
-                segment.ident == "Option"
-            } else {
-                false
-            }
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => false,
     }
 }
 
 fn extract_vec_inner_type(ty: &Type) -> Option<syn::Ident> {
     // Check if this is a Vec<T> type
     match ty {
         Type::Path(TypePath { path, .. }) => {

*** result: Success
