*** toml-pretty-deser-macros/src/lib.rs:138:31: replace == with != in is_option_type

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ replace == with != in is_option_type
@@ -130,17 +130,17 @@
         _ => None,
     }
 }
 
 fn is_option_type(ty: &Type) -> bool {
     match ty {
         Type::Path(TypePath { path, .. }) => {
             if let Some(segment) = path.segments.last() {
-                segment.ident == "Option"
+                segment.ident != /* ~ changed by cargo-mutants ~ */ "Option"
             } else {
                 false
             }
         }
         _ => false,
     }
 }

*** result: Success
