*** toml-pretty-deser-macros/src/lib.rs:172:5: replace is_vec_type -> bool with true

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ replace is_vec_type -> bool with true
@@ -164,26 +164,17 @@
             }
             None
         }
         _ => None,
     }
 }
 
 fn is_vec_type(ty: &Type) -> bool {
-    match ty {
-        Type::Path(TypePath { path, .. }) => {
-            if let Some(segment) = path.segments.last() {
-                segment.ident == "Vec"
-            } else {
-                false
-            }
-        }
-        _ => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[proc_macro_attribute]
 pub fn make_partial(attr: TokenStream, item: TokenStream) -> TokenStream {
     // Parse the boolean argument (default to true)
     let generate_verify = if attr.is_empty() {
         true
     } else {

*** result: Success
