*** toml-pretty-deser-macros/src/lib.rs:9:5: replace derive_string_named_enum -> TokenStream with Default::default()

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ replace derive_string_named_enum -> TokenStream with Default::default()
@@ -1,58 +1,17 @@
 use proc_macro::TokenStream;
 use quote::{format_ident, quote};
 use syn::{
     parse_macro_input, Data, DeriveInput, Fields, GenericArgument, PathArguments, Type, TypePath,
 };
 
 #[proc_macro_derive(StringNamedEnum)]
 pub fn derive_string_named_enum(input: TokenStream) -> TokenStream {
-    let input = parse_macro_input!(input as DeriveInput);
-    let enum_name = &input.ident;
-    let generics = &input.generics;
-    let (impl_generics, ty_generics, where_clause) = generics.split_for_impl();
-
-    let variants = match &input.data {
-        Data::Enum(data) => &data.variants,
-        _ => panic!("StringNamedEnum can only be derived for enums"),
-    };
-
-    let variant_names: Vec<_> = variants
-        .iter()
-        .map(|v| {
-            let name = &v.ident;
-            name.to_string()
-        })
-        .collect();
-
-    let from_str_arms = variants.iter().map(|v| {
-        let name = &v.ident;
-        let name_str = name.to_string();
-        quote! {
-            #name_str => Some(#enum_name::#name)
-        }
-    });
-
-    let expanded = quote! {
-        impl #impl_generics StringNamedEnum for #enum_name #ty_generics #where_clause {
-            fn all_variant_names() -> &'static [&'static str] {
-                &[#(#variant_names),*]
-            }
-
-            fn from_str(s: &str) -> Option<Self> {
-                match s {
-                    #(#from_str_arms,)*
-                    _ => None,
-                }
-            }
-        }
-    };
-
-    TokenStream::from(expanded)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_nested_field(field: &syn::Field) -> bool {
     field
         .attrs
         .iter()
         .any(|attr| attr.path().is_ident("nested"))
 }

*** result: Success
