*** toml-pretty-deser/src/lib.rs:1001:16: delete ! in TomlHelper<'a>::deny_unknown

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete ! in TomlHelper<'a>::deny_unknown
@@ -993,17 +993,17 @@
 
         // Build set of observed normalized names
         let observed_set: HashSet<String> = self.observed.iter().cloned().collect();
 
         for key in keys {
             let normalized_key = self.match_mode.normalize(&key);
 
             // Check if this key was observed (i.e., it matched an expected field)
-            if !observed_set.contains(&normalized_key) {
+            if  /* ~ changed by cargo-mutants ~ */observed_set.contains(&normalized_key) {
                 // This is an unknown key - find available (expected but not yet observed) fields
                 let still_available: Vec<_> = expected_normalized
                     .iter()
                     .filter(|expected| !observed_set.contains(*expected))
                     .map(|s| s.as_str())
                     .collect();
 
                 self.add_err_by_key(

---- test_alias_exact_mode stdout ----
[toml-pretty-deser/tests/basic.rs:715:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        alsoAName = 'using alias'\n        myValue = 42\n        regular_field = 'no alias'\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..18,
                            msg: "Unknown key: alsoAName",
                        },

---- test_any_case_mode_kebab stdout ----
[toml-pretty-deser/tests/basic.rs:814:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        my-field = 'kebab case'\n        another-field = 101\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..17,
                            msg: "Unknown key: my-field",
                        },

---- test_alias_with_any_case_mode stdout ----
[toml-pretty-deser/tests/basic.rs:906:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        myName = 'alias match'\n        myValue = 111\n        regularField = 'case variant'\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..15,
                            msg: "Unknown key: myName",
                        },

failures:
    test_alias_exact_mode
    test_alias_with_any_case_mode
    test_any_case_mode_camel
    test_any_case_mode_kebab
    test_any_case_mode_shouty
    test_any_case_mode_snake
    test_any_case_mode_train
    test_any_case_mode_unknown_key
    test_any_case_mode_upper_camel
    test_arrays_and_nested
    test_arrays_with_optional
    test_complex_mixed_case

test result: FAILED. 7 passed; 30 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
