*** toml-pretty-deser/src/lib.rs:1109:9: replace <impl FromTomlItem for TomlValue<f64>>::is_optional -> bool with false

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace <impl FromTomlItem for TomlValue<f64>>::is_optional -> bool with false
@@ -1101,17 +1101,17 @@
 impl_from_toml_item_integer!(i16, "i16");
 impl_from_toml_item_integer!(i32, "i32");
 impl_from_toml_item_integer!(u32, "u32");
 impl_from_toml_item_integer!(i64, "i64");
 impl_from_toml_item_integer!(u64, "u64");
 
 impl FromTomlItem for TomlValue<f64> {
     fn is_optional() -> bool {
-        true
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn from_toml_item(item: &toml_edit::Item, parent_span: Range<usize>) -> Self {
         match item {
             toml_edit::Item::None => TomlValue {
                 value: None,
                 required: true,
                 state: TomlValueState::Missing {

*** result: Success
