*** toml-pretty-deser/src/lib.rs:1334:9: replace <impl FromTomlItem for TomlValue<Vec<toml_edit::Item>>>::from_toml_item -> Self with Default::default()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace <impl FromTomlItem for TomlValue<Vec<toml_edit::Item>>>::from_toml_item -> Self with Default::default()
@@ -1326,62 +1326,17 @@
 }
 
 impl FromTomlItem for TomlValue<Vec<toml_edit::Item>> {
     fn is_optional() -> bool {
         true
     }
 
     fn from_toml_item(item: &toml_edit::Item, parent_span: Range<usize>) -> Self {
-        match item {
-            toml_edit::Item::None => TomlValue {
-                value: None,
-                required: true,
-                state: TomlValueState::Missing {
-                    key: "".to_string(),
-                    parent_span,
-                },
-            },
-            toml_edit::Item::ArrayOfTables(array) => {
-                let items: Vec<toml_edit::Item> = array
-                    .iter()
-                    .map(|table| toml_edit::Item::Table(table.clone()))
-                    .collect();
-                TomlValue {
-                    required: true,
-                    value: Some(items),
-                    state: TomlValueState::Ok {
-                        span: array.span().unwrap_or(parent_span.clone()),
-                    },
-                }
-            }
-            toml_edit::Item::Value(toml_edit::Value::Array(array)) => {
-                // Also support regular arrays with inline tables
-                let items: Vec<toml_edit::Item> = array
-                    .iter()
-                    .map(|val| toml_edit::Item::Value(val.clone()))
-                    .collect();
-                TomlValue {
-                    required: true,
-                    value: Some(items),
-                    state: TomlValueState::Ok {
-                        span: array.span().unwrap_or(parent_span.clone()),
-                    },
-                }
-            }
-            _ => TomlValue {
-                required: true,
-                value: None,
-                state: TomlValueState::WrongType {
-                    span: item.span().unwrap_or(parent_span.clone()),
-                    expected: "array of tables",
-                    found: "other type",
-                },
-            },
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 macro_rules! impl_from_toml_item_option {
     ($ty:ty) => {
         impl FromTomlItem for TomlValue<Option<$ty>> {
             fn is_optional() -> bool {
                 false

---- test_nested_happy stdout ----
[toml-pretty-deser/tests/basic.rs:463:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuter {
            nested: TomlValue {
                value: Some(
                    PartialNested {
                        name: TomlValue {
                            value: Some(
                                "a",
                            ),
                            state: Ok {
                                span: 119..122,

failures:
    test_nested_happy

test result: FAILED. 36 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
