*** toml-pretty-deser/src/lib.rs:1356:13: delete match arm toml_edit::Item::Value(toml_edit::Value::Array(array)) in <impl FromTomlItem for TomlValue<Vec<toml_edit::Item>>>::from_toml_item

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm toml_edit::Item::Value(toml_edit::Value::Array(array)) in <impl FromTomlItem for TomlValue<Vec<toml_edit::Item>>>::from_toml_item
@@ -1348,30 +1348,17 @@
                 TomlValue {
                     required: true,
                     value: Some(items),
                     state: TomlValueState::Ok {
                         span: array.span().unwrap_or(parent_span.clone()),
                     },
                 }
             }
-            toml_edit::Item::Value(toml_edit::Value::Array(array)) => {
-                // Also support regular arrays with inline tables
-                let items: Vec<toml_edit::Item> = array
-                    .iter()
-                    .map(|val| toml_edit::Item::Value(val.clone()))
-                    .collect();
-                TomlValue {
-                    required: true,
-                    value: Some(items),
-                    state: TomlValueState::Ok {
-                        span: array.span().unwrap_or(parent_span.clone()),
-                    },
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => TomlValue {
                 required: true,
                 value: None,
                 state: TomlValueState::WrongType {
                     span: item.span().unwrap_or(parent_span.clone()),
                     expected: "array of tables",
                     found: "other type",
                 },

*** result: Success
