*** toml-pretty-deser/src/lib.rs:1430:9: replace <impl FromTomlItem for TomlValue<Option<toml_edit::Item>>>::from_toml_item -> Self with Default::default()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace <impl FromTomlItem for TomlValue<Option<toml_edit::Item>>>::from_toml_item -> Self with Default::default()
@@ -1422,35 +1422,17 @@
 
 // Special implementation for Option<toml_edit::Item> to support optional nested structs
 impl FromTomlItem for TomlValue<Option<toml_edit::Item>> {
     fn is_optional() -> bool {
         false
     }
 
     fn from_toml_item(item: &toml_edit::Item, parent_span: Range<usize>) -> Self {
-        let mut res: TomlValue<toml_edit::Item> = FromTomlItem::from_toml_item(item, parent_span);
-        res.required = false;
-        match res.state {
-            TomlValueState::Ok { span } => TomlValue {
-                required: false,
-                value: Some(res.value),
-                state: TomlValueState::Ok { span },
-            },
-            TomlValueState::Missing { .. } => TomlValue {
-                required: false,
-                value: Some(None),
-                state: TomlValueState::Ok { span: 0..0 },
-            },
-            _ => TomlValue {
-                value: None,
-                required: false,
-                state: res.state,
-            },
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 macro_rules! impl_from_toml_item_vec {
     ($ty:ty, $name:expr) => {
         impl FromTomlItem for TomlValue<Vec<$ty>> {
             fn is_optional() -> bool {
                 true

---- test_nested_happy stdout ----
[toml-pretty-deser/tests/basic.rs:463:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuter {
            nested: TomlValue {
                value: Some(
                    PartialNested {
                        name: TomlValue {
                            value: Some(
                                "a",
                            ),
                            state: Ok {
                                span: 119..122,

---- test_nested_happy_half stdout ----
[toml-pretty-deser/tests/basic.rs:488:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [nested]\n            name = 'a'\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..17,
                            msg: "Missing required key: value",
                        },

---- test_two_level_nested_happy stdout ----
[toml-pretty-deser/tests/basic.rs:546:5] &result = Err(
    StillIncomplete(
        [],
        PartialRoot {
            level1: TomlValue {
                value: Some(
                    PartialLevel1 {
                        name: TomlValue {
                            value: Some(
                                "level1_name",
                            ),
                            state: Ok {
                                span: 37..50,

failures:
    test_nested_happy
    test_nested_happy_half
    test_two_level_nested_happy
    test_two_level_nested_inline_table
    test_two_level_nested_with_optional_nested

test result: FAILED. 32 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
