*** toml-pretty-deser/src/lib.rs:1603:13: delete match arm TomlValueState::Ok{..} in TomlValue<T>::into_option

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Ok{..} in TomlValue<T>::into_option
@@ -1595,17 +1595,17 @@
 
 impl<T> TomlValue<T> {
     pub fn has_value(&self) -> bool {
         matches!(self.state, TomlValueState::Ok { .. })
     }
 
     pub fn into_option(self) -> Option<T> {
         match self.state {
-            TomlValueState::Ok { .. } => self.value,
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         }
     }
 
     pub fn as_ref(&self) -> Option<&T> {
         match self.state {
             TomlValueState::Ok { .. } => self.value.as_ref(),
             _ => None,

---- test_missing stdout ----
[toml-pretty-deser/tests/basic.rs:97:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 0..0,
                            msg: "Missing required key: a_u8",
                        },

failures:
    test_missing

test result: FAILED. 36 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
