*** toml-pretty-deser/src/lib.rs:1826:29: delete match arm toml_edit::Item::Table(table) in <impl AsNested<Option<P>> for TomlValue<Option<toml_edit::Item>>>::as_nested

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm toml_edit::Item::Table(table) in <impl AsNested<Option<P>> for TomlValue<Option<toml_edit::Item>>>::as_nested
@@ -1818,42 +1818,17 @@
         errors: &Rc<RefCell<Vec<AnnotatedError>>>,
         mode: FieldMatchMode,
     ) -> TomlValue<Option<P>> {
         match &self.state {
             TomlValueState::Ok { span } => {
                 if let Some(ref opt_item) = self.value {
                     if let Some(item) = opt_item {
                         match item {
-                            toml_edit::Item::Table(table) => {
-                                let error_count_before = errors.borrow().len();
-                                let mut helper = TomlHelper::new(table, errors.clone(), mode);
-                                let partial =
-                                    P::from_toml_table(&mut helper, &()).verify(&mut helper, &());
-                                helper.deny_unknown();
-
-                                let error_count_after = errors.borrow().len();
-
-                                if error_count_after > error_count_before {
-                                    TomlValue {
-                                        value: Some(Some(partial)),
-                                        required: self.required,
-                                        state: TomlValueState::ValidationFailed {
-                                            span: span.clone(),
-                                            message: "Nested struct has errors".to_string(),
-                                        },
-                                    }
-                                } else {
-                                    TomlValue {
-                                        value: Some(Some(partial)),
-                                        required: self.required,
-                                        state: TomlValueState::Ok { span: span.clone() },
-                                    }
-                                }
-                            }
+                             /* ~ changed by cargo-mutants ~ */
                             toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) => {
                                 let error_count_before = errors.borrow().len();
                                 let mut helper =
                                     TomlHelper::new_inline(table, errors.clone(), mode);
                                 let partial =
                                     P::from_toml_table(&mut helper, &()).verify(&mut helper, &());
                                 helper.deny_unknown();

---- test_nested_happy stdout ----
[toml-pretty-deser/tests/basic.rs:463:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuter {
            nested: TomlValue {
                value: Some(
                    PartialNested {
                        name: TomlValue {
                            value: Some(
                                "a",
                            ),
                            state: Ok {
                                span: 119..122,

---- test_two_level_nested_happy stdout ----
[toml-pretty-deser/tests/basic.rs:546:5] &result = Err(
    StillIncomplete(
        [],
        PartialRoot {
            level1: TomlValue {
                value: Some(
                    PartialLevel1 {
                        name: TomlValue {
                            value: Some(
                                "level1_name",
                            ),
                            state: Ok {
                                span: 37..50,

---- test_two_level_nested_with_optional_nested stdout ----
[toml-pretty-deser/tests/basic.rs:575:5] &result = Err(
    StillIncomplete(
        [],
        PartialRoot {
            level1: TomlValue {
                value: Some(
                    PartialLevel1 {
                        name: TomlValue {
                            value: Some(
                                "l1",
                            ),
                            state: Ok {
                                span: 37..41,

failures:
    test_nested_happy
    test_two_level_nested_happy
    test_two_level_nested_with_optional_nested

test result: FAILED. 34 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
