*** toml-pretty-deser/src/lib.rs:1953:59: replace > with < in <impl AsNested<Vec<P>> for TomlValue<Vec<toml_edit::Item>>>::as_nested

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace > with < in <impl AsNested<Vec<P>> for TomlValue<Vec<toml_edit::Item>>>::as_nested
@@ -1945,17 +1945,17 @@
                                 let item_error_count_before = errors.borrow().len();
                                 let mut helper = TomlHelper::new(table, errors.clone(), mode);
                                 let partial =
                                     P::from_toml_table(&mut helper, &()).verify(&mut helper, &());
                                 helper.deny_unknown();
 
                                 let item_error_count_after = errors.borrow().len();
 
-                                if item_error_count_after > item_error_count_before {
+                                if item_error_count_after < /* ~ changed by cargo-mutants ~ */ item_error_count_before {
                                     // There were errors during this item's deserialization
                                     // but we still push it to results so we can report all errors
                                     results.push(partial);
                                 } else {
                                     results.push(partial);
                                 }
                             }
                             _ => {

*** result: Success
