*** toml-pretty-deser/src/lib.rs:271:13: delete match arm TomlValueState::Ok{span} in <impl AsEnum<Vec<E>> for TomlValue<Vec<String>>>::as_enum

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Ok{span} in <impl AsEnum<Vec<E>> for TomlValue<Vec<String>>>::as_enum
@@ -263,64 +263,17 @@
             },
         }
     }
 }
 
 impl<E: StringNamedEnum> AsEnum<Vec<E>> for TomlValue<Vec<String>> {
     fn as_enum(self) -> TomlValue<Vec<E>> {
         match &self.state {
-            TomlValueState::Ok { span } => {
-                if let Some(ref strings) = self.value {
-                    let mut values = Vec::with_capacity(strings.len());
-                    let mut has_error = false;
-                    let mut error_message = String::new();
-
-                    for s in strings {
-                        match E::from_str(s) {
-                            Some(enum_val) => values.push(enum_val),
-                            None => {
-                                has_error = true;
-                                let valid_names = E::all_variant_names().join(", ");
-                                error_message = format!(
-                                    "Invalid enum variant '{}'. Valid variants are: {}",
-                                    s, valid_names
-                                );
-                                break;
-                            }
-                        }
-                    }
-
-                    if has_error {
-                        TomlValue {
-                            value: None,
-                            required: self.required,
-                            state: TomlValueState::ValidationFailed {
-                                span: span.clone(),
-                                message: error_message,
-                            },
-                        }
-                    } else {
-                        TomlValue {
-                            value: Some(values),
-                            required: self.required,
-                            state: TomlValueState::Ok { span: span.clone() },
-                        }
-                    }
-                } else {
-                    TomlValue {
-                        value: None,
-                        required: self.required,
-                        state: TomlValueState::ValidationFailed {
-                            span: span.clone(),
-                            message: "Cannot convert empty value to enum".to_string(),
-                        },
-                    }
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             TomlValueState::Missing { key, parent_span } => TomlValue {
                 value: None,
                 required: self.required,
                 state: TomlValueState::Missing {
                     key: key.clone(),
                     parent_span: parent_span.clone(),
                 },
             },

---- test_enum_happy_path stdout ----

thread 'test_enum_happy_path' (2378539) panicked at toml-pretty-deser/src/lib.rs:1570:53:
called `Option::unwrap()` on a `None` value

---- test_enum_optional_missing stdout ----

thread 'test_enum_optional_missing' (2378542) panicked at toml-pretty-deser/src/lib.rs:1570:53:
called `Option::unwrap()` on a `None` value

failures:
    test_enum_happy_path
    test_enum_optional_missing

test result: FAILED. 35 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
