*** toml-pretty-deser/src/lib.rs:508:9: replace <impl Display for DeserError<P>>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace <impl Display for DeserError<P>>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -500,25 +500,17 @@
 pub enum DeserError<P> {
     ParsingFailure(TomlError),
     DeserFailure(Vec<HydratedAnnotatedError>, P),
     StillIncomplete(Vec<HydratedAnnotatedError>, P),
 }
 
 impl<P> Display for DeserError<P> {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            DeserError::ParsingFailure(e) => write!(f, "TOML parsing error: {}", e),
-            DeserError::DeserFailure(errors, _) => {
-                write!(f, "Deserialization failed with {} errors", errors.len())
-            }
-            DeserError::StillIncomplete(errors, _) => {
-                write!(f, "Incomplete deserialization with {} errors", errors.len())
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<P: std::fmt::Debug> std::error::Error for DeserError<P> {
     fn source(&self) -> Option<&(dyn std::error::Error + 'static)> {
         match self {
             DeserError::ParsingFailure(e) => Some(e),
             _ => None,

*** result: Success
