*** toml-pretty-deser/src/lib.rs:523:13: delete match arm DeserError::ParsingFailure(e) in <impl std::error::Error for DeserError<P>>::source

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm DeserError::ParsingFailure(e) in <impl std::error::Error for DeserError<P>>::source
@@ -515,17 +515,17 @@
             }
         }
     }
 }
 
 impl<P: std::fmt::Debug> std::error::Error for DeserError<P> {
     fn source(&self) -> Option<&(dyn std::error::Error + 'static)> {
         match self {
-            DeserError::ParsingFailure(e) => Some(e),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         }
     }
 }
 
 impl<P> From<TomlError> for DeserError<P> {
     fn from(value: TomlError) -> Self {
         DeserError::ParsingFailure(value)

*** result: Success
