*** toml-pretty-deser/src/lib.rs:710:28: delete ! in HydratedAnnotatedError::pretty

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete ! in HydratedAnnotatedError::pretty
@@ -702,17 +702,17 @@
             write!(&mut out, "{}", blockf).expect("can't fail");
             writeln!(&mut out, "{}", block.epilogue()).expect("can't fail");
 
             if let Some(help) = self.inner.help.as_ref() {
                 if !help.is_empty() {
                     let mut first = true;
                     write!(&mut out, "Hint: ").expect("Can't fail");
                     for line in help.lines() {
-                        if !first {
+                        if  /* ~ changed by cargo-mutants ~ */first {
                             write!(&mut out, "      ").expect("can't fail");
                         }
                         first = false;
                         writeln!(&mut out, "{}", line).expect("can't fail");
                     }
                 }
             }
             out

---- test_two_errors_pretty stdout ----
[toml-pretty-deser/tests/basic.rs:669:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [level1]\n            name = 'l1'\n\n        [level1.level2]\n            other = 2\n            # missing data field\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 79..84,
                            msg: "Unknown key: other",
                        },

failures:
    test_two_errors_pretty

test result: FAILED. 36 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
