*** toml-pretty-deser/src/lib.rs:905:13: delete match arm 0 in TomlHelper<'a>::get_with_aliases

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm 0 in TomlHelper<'a>::get_with_aliases
@@ -897,27 +897,17 @@
 
         // Register this field as expected
         self.expect_field(query_key, &aliases);
 
         // Try to find a matching key (considering aliases and match mode)
         let found_keys = self.find_matching_keys(query_key, &aliases);
 
         match found_keys.len() {
-            0 => {
-                // No match found
-                let mut res: TomlValue<T> = //todo: refactor into new_empty_missing...
-                    FromTomlItem::from_toml_item(&toml_edit::Item::None, parent_span.clone());
-                if let TomlValueState::Missing { ref mut key, .. } = res.state {
-                    if key.is_empty() {
-                        *key = query_key.to_string().clone();
-                    }
-                }
-                res
-            }
+             /* ~ changed by cargo-mutants ~ */
             1 => {
                 let (matched_key, item) = found_keys.iter().next().unwrap();
                 let res: TomlValue<T> = FromTomlItem::from_toml_item(&item, parent_span);
                 self.observed.push(self.match_mode.normalize(&matched_key));
                 res
             }
             _ => {
                 let spans = found_keys

---- test_alias_exact_mode_failure stdout ----

thread 'test_alias_exact_mode_failure' (2366684) panicked at toml-pretty-deser/src/lib.rs:1626:26:
index out of bounds: the len is 0 but the index is 0

---- test_arrays_and_nested stdout ----

thread 'test_arrays_and_nested' (2366694) panicked at toml-pretty-deser/src/lib.rs:1626:26:
index out of bounds: the len is 0 but the index is 0

---- test_any_case_mode_unknown_key stdout ----

thread 'test_any_case_mode_unknown_key' (2366691) panicked at toml-pretty-deser/src/lib.rs:1626:26:
index out of bounds: the len is 0 but the index is 0

failures:
    test_alias_exact_mode_failure
    test_any_case_mode_unknown_key
    test_array_wrong_element_type
    test_arrays_and_nested
    test_enum_invalid_variant
    test_enum_missing_required
    test_enum_optional_missing
    test_missing
    test_nested_happy_half
    test_optional_missing
    test_two_errors_pretty
    test_two_level_nested_happy

test result: FAILED. 21 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
