*** toml-pretty-deser-macros/src/lib.rs:104:5: replace extract_type_name -> Option<syn::Ident> with None

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ replace extract_type_name -> Option<syn::Ident> with None
@@ -96,20 +96,17 @@
             }
         }
     }
 
     aliases
 }
 
 fn extract_type_name(ty: &Type) -> Option<syn::Ident> {
-    match ty {
-        Type::Path(TypePath { path, .. }) => path.get_ident().cloned(),
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn extract_option_inner_type(ty: &Type) -> Option<syn::Ident> {
     // Check if this is an Option<T> type
     match ty {
         Type::Path(TypePath { path, .. }) => {
             // Check if the path ends with "Option"
             if let Some(segment) = path.segments.last() {

*** result: Success
