*** toml-pretty-deser-macros/src/lib.rs:112:5: replace extract_option_inner_type -> Option<syn::Ident> with None

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ replace extract_option_inner_type -> Option<syn::Ident> with None
@@ -104,36 +104,17 @@
     match ty {
         Type::Path(TypePath { path, .. }) => path.get_ident().cloned(),
         _ => None,
     }
 }
 
 fn extract_option_inner_type(ty: &Type) -> Option<syn::Ident> {
     // Check if this is an Option<T> type
-    match ty {
-        Type::Path(TypePath { path, .. }) => {
-            // Check if the path ends with "Option"
-            if let Some(segment) = path.segments.last() {
-                if segment.ident == "Option" {
-                    // Extract the inner type from the angle brackets
-                    match &segment.arguments {
-                        PathArguments::AngleBracketed(args) => {
-                            if let Some(GenericArgument::Type(inner_ty)) = args.args.first() {
-                                return extract_type_name(&inner_ty);
-                            }
-                        }
-                        _ => {}
-                    }
-                }
-            }
-            None
-        }
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_option_type(ty: &Type) -> bool {
     match ty {
         Type::Path(TypePath { path, .. }) => {
             if let Some(segment) = path.segments.last() {
                 segment.ident == "Option"
             } else {

*** result: Success
