*** toml-pretty-deser-macros/src/lib.rs:113:9: delete match arm Type::Path(TypePath{path, ..}) in extract_option_inner_type

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ delete match arm Type::Path(TypePath{path, ..}) in extract_option_inner_type
@@ -105,33 +105,17 @@
         Type::Path(TypePath { path, .. }) => path.get_ident().cloned(),
         _ => None,
     }
 }
 
 fn extract_option_inner_type(ty: &Type) -> Option<syn::Ident> {
     // Check if this is an Option<T> type
     match ty {
-        Type::Path(TypePath { path, .. }) => {
-            // Check if the path ends with "Option"
-            if let Some(segment) = path.segments.last() {
-                if segment.ident == "Option" {
-                    // Extract the inner type from the angle brackets
-                    match &segment.arguments {
-                        PathArguments::AngleBracketed(args) => {
-                            if let Some(GenericArgument::Type(inner_ty)) = args.args.first() {
-                                return extract_type_name(&inner_ty);
-                            }
-                        }
-                        _ => {}
-                    }
-                }
-            }
-            None
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 fn is_option_type(ty: &Type) -> bool {
     match ty {
         Type::Path(TypePath { path, .. }) => {
             if let Some(segment) = path.segments.last() {

*** result: Success
