*** toml-pretty-deser-macros/src/lib.rs:149:5: replace extract_vec_inner_type -> Option<syn::Ident> with None

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ replace extract_vec_inner_type -> Option<syn::Ident> with None
@@ -141,36 +141,17 @@
             }
         }
         _ => false,
     }
 }
 
 fn extract_vec_inner_type(ty: &Type) -> Option<syn::Ident> {
     // Check if this is a Vec<T> type
-    match ty {
-        Type::Path(TypePath { path, .. }) => {
-            // Check if the path ends with "Vec"
-            if let Some(segment) = path.segments.last() {
-                if segment.ident == "Vec" {
-                    // Extract the inner type from the angle brackets
-                    match &segment.arguments {
-                        PathArguments::AngleBracketed(args) => {
-                            if let Some(GenericArgument::Type(inner_ty)) = args.args.first() {
-                                return extract_type_name(&inner_ty);
-                            }
-                        }
-                        _ => {}
-                    }
-                }
-            }
-            None
-        }
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_vec_type(ty: &Type) -> bool {
     match ty {
         Type::Path(TypePath { path, .. }) => {
             if let Some(segment) = path.segments.last() {
                 segment.ident == "Vec"
             } else {

*** result: Success
