*** toml-pretty-deser-macros/src/lib.rs:153:34: replace == with != in extract_vec_inner_type

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ replace == with != in extract_vec_inner_type
@@ -145,17 +145,17 @@
 }
 
 fn extract_vec_inner_type(ty: &Type) -> Option<syn::Ident> {
     // Check if this is a Vec<T> type
     match ty {
         Type::Path(TypePath { path, .. }) => {
             // Check if the path ends with "Vec"
             if let Some(segment) = path.segments.last() {
-                if segment.ident == "Vec" {
+                if segment.ident != /* ~ changed by cargo-mutants ~ */ "Vec" {
                     // Extract the inner type from the angle brackets
                     match &segment.arguments {
                         PathArguments::AngleBracketed(args) => {
                             if let Some(GenericArgument::Type(inner_ty)) = args.args.first() {
                                 return extract_type_name(&inner_ty);
                             }
                         }
                         _ => {}

*** result: Success
