*** toml-pretty-deser-macros/src/lib.rs:156:25: delete match arm PathArguments::AngleBracketed(args) in extract_vec_inner_type

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ delete match arm PathArguments::AngleBracketed(args) in extract_vec_inner_type
@@ -148,21 +148,17 @@
     // Check if this is a Vec<T> type
     match ty {
         Type::Path(TypePath { path, .. }) => {
             // Check if the path ends with "Vec"
             if let Some(segment) = path.segments.last() {
                 if segment.ident == "Vec" {
                     // Extract the inner type from the angle brackets
                     match &segment.arguments {
-                        PathArguments::AngleBracketed(args) => {
-                            if let Some(GenericArgument::Type(inner_ty)) = args.args.first() {
-                                return extract_type_name(&inner_ty);
-                            }
-                        }
+                         /* ~ changed by cargo-mutants ~ */
                         _ => {}
                     }
                 }
             }
             None
         }
         _ => None,
     }

*** result: Success
