*** toml-pretty-deser-macros/src/lib.rs:175:31: replace == with != in is_vec_type

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ replace == with != in is_vec_type
@@ -167,17 +167,17 @@
         _ => None,
     }
 }
 
 fn is_vec_type(ty: &Type) -> bool {
     match ty {
         Type::Path(TypePath { path, .. }) => {
             if let Some(segment) = path.segments.last() {
-                segment.ident == "Vec"
+                segment.ident != /* ~ changed by cargo-mutants ~ */ "Vec"
             } else {
                 false
             }
         }
         _ => false,
     }
 }

*** result: Success
