*** toml-pretty-deser-macros/src/lib.rs:192:13: delete match arm "true" in make_partial

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ delete match arm "true" in make_partial
@@ -184,17 +184,17 @@
 #[proc_macro_attribute]
 pub fn make_partial(attr: TokenStream, item: TokenStream) -> TokenStream {
     // Parse the boolean argument (default to true)
     let generate_verify = if attr.is_empty() {
         true
     } else {
         let attr_str = attr.to_string();
         match attr_str.as_str() {
-            "true" => true,
+             /* ~ changed by cargo-mutants ~ */
             "false" => false,
             _ => panic!("make_partial expects 'true' or 'false', got: {}", attr_str),
         }
     };
 
     let input = parse_macro_input!(item as DeriveInput);
 
     let struct_name = &input.ident;

*** result: Success
