*** toml-pretty-deser-macros/src/lib.rs:220:25: replace && with || in make_partial

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ replace && with || in make_partial
@@ -212,17 +212,17 @@
 
     // Create a version of the input struct with #[nested], #[as_enum], and #[alias(...)] attributes stripped
     let mut cleaned_input = input.clone();
     if let Data::Struct(ref mut data) = cleaned_input.data {
         if let Fields::Named(ref mut fields) = data.fields {
             for field in fields.named.iter_mut() {
                 field.attrs.retain(|attr| {
                     !attr.path().is_ident("nested")
-                        && !attr.path().is_ident("as_enum")
+                        || /* ~ changed by cargo-mutants ~ */ !attr.path().is_ident("as_enum")
                         && !attr.path().is_ident("alias")
                 });
             }
         }
     }
 
     // Validate nested fields first
     for f in fields.iter() {

*** result: Success
