*** toml-pretty-deser-macros/src/lib.rs:61:5: replace is_as_enum_field -> bool with true

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ replace is_as_enum_field -> bool with true
@@ -53,20 +53,17 @@
 fn is_nested_field(field: &syn::Field) -> bool {
     field
         .attrs
         .iter()
         .any(|attr| attr.path().is_ident("nested"))
 }
 
 fn is_as_enum_field(field: &syn::Field) -> bool {
-    field
-        .attrs
-        .iter()
-        .any(|attr| attr.path().is_ident("as_enum"))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Extract aliases from #[alias("name1", "name2", ...)] attribute
 fn extract_aliases(field: &syn::Field) -> Vec<String> {
     let mut aliases = Vec::new();
 
     for attr in &field.attrs {
         if attr.path().is_ident("alias") {

*** result: Success
