*** toml-pretty-deser-macros/src/lib.rs:69:5: replace extract_aliases -> Vec<String> with vec![]

*** mutation diff:
--- toml-pretty-deser-macros/src/lib.rs
+++ replace extract_aliases -> Vec<String> with vec![]
@@ -61,48 +61,17 @@
     field
         .attrs
         .iter()
         .any(|attr| attr.path().is_ident("as_enum"))
 }
 
 /// Extract aliases from #[alias("name1", "name2", ...)] attribute
 fn extract_aliases(field: &syn::Field) -> Vec<String> {
-    let mut aliases = Vec::new();
-
-    for attr in &field.attrs {
-        if attr.path().is_ident("alias") {
-            // Parse the alias attribute
-            // Expected format: #[alias("name1")] or #[alias("name1", "name2")]
-            let result: Result<Vec<String>, _> =
-                attr.parse_args_with(|input: syn::parse::ParseStream| {
-                    // input is already the content inside the parentheses
-                    let mut names = Vec::new();
-                    loop {
-                        if input.is_empty() {
-                            break;
-                        }
-
-                        let lit: syn::LitStr = input.parse()?;
-                        names.push(lit.value());
-
-                        if !input.is_empty() {
-                            input.parse::<syn::Token![,]>()?;
-                        }
-                    }
-                    Ok(names)
-                });
-
-            if let Ok(found_aliases) = result {
-                aliases.extend(found_aliases);
-            }
-        }
-    }
-
-    aliases
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn extract_type_name(ty: &Type) -> Option<syn::Ident> {
     match ty {
         Type::Path(TypePath { path, .. }) => path.get_ident().cloned(),
         _ => None,
     }
 }

*** result: Success
