*** toml-pretty-deser/src/lib.rs:1009:40: delete ! in TomlHelper<'a>::deny_unknown

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete ! in TomlHelper<'a>::deny_unknown
@@ -1001,17 +1001,17 @@
         for key in keys {
             let normalized_key = self.match_mode.normalize(&key);
 
             // Check if this key was observed (i.e., it matched an expected field)
             if !observed_set.contains(&normalized_key) {
                 // This is an unknown key - find available (expected but not yet observed) fields
                 let still_available: Vec<_> = expected_normalized
                     .iter()
-                    .filter(|expected| !observed_set.contains(*expected))
+                    .filter(|expected|  /* ~ changed by cargo-mutants ~ */observed_set.contains(*expected))
                     .map(|s| s.as_str())
                     .collect();
 
                 self.add_err_by_key(
                     &key,
                     &format!("Unknown key: {}", key),
                     &suggest_alternatives(&key, &still_available),
                 );

---- test_two_errors_pretty stdout ----
[toml-pretty-deser/tests/basic.rs:739:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [level1]\n            name = 'l1'\n\n        [level1.level2]\n            other = 2\n            # missing data field\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 79..84,
                            msg: "Unknown key: other",
                        },

failures:
    test_two_errors_pretty

test result: FAILED. 37 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
