*** toml-pretty-deser/src/lib.rs:1183:9: replace <impl FromTomlItem for TomlValue<bool>>::from_toml_item -> Self with Default::default()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace <impl FromTomlItem for TomlValue<bool>>::from_toml_item -> Self with Default::default()
@@ -1175,63 +1175,17 @@
 }
 
 impl FromTomlItem for TomlValue<bool> {
     fn is_optional() -> bool {
         true
     }
 
     fn from_toml_item(item: &toml_edit::Item, parent_span: Range<usize>) -> Self {
-        match item {
-            toml_edit::Item::None => TomlValue {
-                value: None,
-                required: true,
-                state: TomlValueState::Missing {
-                    key: "".to_string(),
-                    parent_span,
-                },
-            },
-            toml_edit::Item::Value(toml_edit::Value::Boolean(formatted)) => {
-                let value = *formatted.value();
-                TomlValue {
-                    required: true,
-                    value: Some(value),
-                    state: TomlValueState::Ok {
-                        span: formatted.span().unwrap_or(parent_span.clone()),
-                    },
-                }
-            }
-            toml_edit::Item::Value(value) => TomlValue {
-                required: true,
-                value: None,
-                state: TomlValueState::WrongType {
-                    span: value.span().unwrap_or(parent_span.clone()),
-                    expected: "bool",
-                    found: value.type_name(),
-                },
-            },
-            toml_edit::Item::Table(value) => TomlValue {
-                required: true,
-                value: None,
-                state: TomlValueState::WrongType {
-                    span: value.span().unwrap_or(parent_span.clone()),
-                    expected: "bool",
-                    found: "table",
-                },
-            },
-            toml_edit::Item::ArrayOfTables(value) => TomlValue {
-                required: true,
-                value: None,
-                state: TomlValueState::WrongType {
-                    span: value.span().unwrap_or(parent_span.clone()),
-                    expected: "bool",
-                    found: "array of tables",
-                },
-            },
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FromTomlItem for TomlValue<String> {
     fn is_optional() -> bool {
         true
     }

---- test_happy_path stdout ----
[toml-pretty-deser/tests/basic.rs:59:5] &result = Err(
    StillIncomplete(
        [],
        PartialOutput {
            a_u8: TomlValue {
                value: Some(
                    255,
                ),
                state: Ok {
                    span: 20..23,
                },
                required: true,
            },

---- test_optional_missing stdout ----
[toml-pretty-deser/tests/basic.rs:128:5] &result = Err(
    StillIncomplete(
        [],
        PartialOutput {
            a_u8: TomlValue {
                value: Some(
                    255,
                ),
                state: Ok {
                    span: 20..23,
                },
                required: true,
            },

failures:
    test_happy_path
    test_optional_missing

test result: FAILED. 36 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
