*** toml-pretty-deser/src/lib.rs:1235:9: replace <impl FromTomlItem for TomlValue<String>>::from_toml_item -> Self with Default::default()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace <impl FromTomlItem for TomlValue<String>>::from_toml_item -> Self with Default::default()
@@ -1227,63 +1227,17 @@
 }
 
 impl FromTomlItem for TomlValue<String> {
     fn is_optional() -> bool {
         true
     }
 
     fn from_toml_item(item: &toml_edit::Item, parent_span: Range<usize>) -> Self {
-        match item {
-            toml_edit::Item::None => TomlValue {
-                value: None,
-                required: true,
-                state: TomlValueState::Missing {
-                    key: "".to_string(),
-                    parent_span,
-                },
-            },
-            toml_edit::Item::Value(toml_edit::Value::String(formatted)) => {
-                let value = formatted.value().to_string();
-                TomlValue {
-                    required: true,
-                    value: Some(value),
-                    state: TomlValueState::Ok {
-                        span: formatted.span().unwrap_or(parent_span.clone()),
-                    },
-                }
-            }
-            toml_edit::Item::Value(value) => TomlValue {
-                required: true,
-                value: None,
-                state: TomlValueState::WrongType {
-                    span: value.span().unwrap_or(parent_span.clone()),
-                    expected: "string",
-                    found: value.type_name(),
-                },
-            },
-            toml_edit::Item::Table(value) => TomlValue {
-                required: true,
-                value: None,
-                state: TomlValueState::WrongType {
-                    span: value.span().unwrap_or(parent_span.clone()),
-                    expected: "string",
-                    found: "table",
-                },
-            },
-            toml_edit::Item::ArrayOfTables(value) => TomlValue {
-                required: true,
-                value: None,
-                state: TomlValueState::WrongType {
-                    span: value.span().unwrap_or(parent_span.clone()),
-                    expected: "string",
-                    found: "array of tables",
-                },
-            },
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // Implementation for raw toml_edit::Item - used for nested struct deserialization
 impl FromTomlItem for TomlValue<toml_edit::Item> {
     fn is_optional() -> bool {
         true
     }

---- test_alias_exact_mode stdout ----
[toml-pretty-deser/tests/basic.rs:715:5] &result = Err(
    StillIncomplete(
        [],
        PartialAliasedOutput {
            my_name: TomlValue {
                value: None,
                state: NotSet,
                required: false,
            },
            my_value: TomlValue {
                value: Some(
                    42,
                ),

---- test_any_case_mode_camel stdout ----
[toml-pretty-deser/tests/basic.rs:796:5] &result = Err(
    StillIncomplete(
        [],
        PartialCaseOutput {
            my_field: TomlValue {
                value: None,
                state: NotSet,
                required: false,
            },
            another_field: TomlValue {
                value: Some(
                    789,
                ),

---- test_any_case_mode_kebab stdout ----
[toml-pretty-deser/tests/basic.rs:814:5] &result = Err(
    StillIncomplete(
        [],
        PartialCaseOutput {
            my_field: TomlValue {
                value: None,
                state: NotSet,
                required: false,
            },
            another_field: TomlValue {
                value: Some(
                    101,
                ),

failures:
    test_alias_exact_mode
    test_alias_with_any_case_mode
    test_any_case_mode_camel
    test_any_case_mode_kebab
    test_any_case_mode_shouty
    test_any_case_mode_snake
    test_any_case_mode_train
    test_any_case_mode_upper_camel
    test_arrays_and_nested
    test_arrays_with_optional
    test_complex_mixed_case
    test_enum_happy_path

test result: FAILED. 10 passed; 27 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
