*** toml-pretty-deser/src/lib.rs:1296:9: replace <impl FromTomlItem for TomlValue<toml_edit::Item>>::from_toml_item -> Self with Default::default()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace <impl FromTomlItem for TomlValue<toml_edit::Item>>::from_toml_item -> Self with Default::default()
@@ -1288,49 +1288,17 @@
 
 // Implementation for raw toml_edit::Item - used for nested struct deserialization
 impl FromTomlItem for TomlValue<toml_edit::Item> {
     fn is_optional() -> bool {
         true
     }
 
     fn from_toml_item(item: &toml_edit::Item, parent_span: Range<usize>) -> Self {
-        match item {
-            toml_edit::Item::None => TomlValue {
-                value: None,
-                required: true,
-                state: TomlValueState::Missing {
-                    key: "".to_string(),
-                    parent_span,
-                },
-            },
-            toml_edit::Item::Table(table) => TomlValue {
-                required: true,
-                value: Some(toml_edit::Item::Table(table.clone())),
-                state: TomlValueState::Ok {
-                    span: table.span().unwrap_or(parent_span.clone()),
-                },
-            },
-            toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) => TomlValue {
-                required: true,
-                value: Some(toml_edit::Item::Value(toml_edit::Value::InlineTable(
-                    table.clone(),
-                ))),
-                state: TomlValueState::Ok {
-                    span: table.span().unwrap_or(parent_span.clone()),
-                },
-            },
-            _ => TomlValue {
-                required: true,
-                value: Some(item.clone()),
-                state: TomlValueState::Ok {
-                    span: item.span().unwrap_or(parent_span.clone()),
-                },
-            },
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FromTomlItem for TomlValue<Vec<toml_edit::Item>> {
     fn is_optional() -> bool {
         true
     }

---- test_nested_happy_half stdout ----
[toml-pretty-deser/tests/basic.rs:493:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuter {
            nested: TomlValue {
                value: None,
                state: NotSet,
                required: false,
            },
            inline_nested: TomlValue {
                value: None,
                state: NotSet,
                required: false,

---- test_nested_with_alias stdout ----
[toml-pretty-deser/tests/basic.rs:1012:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuterAliased {
            nested: TomlValue {
                value: None,
                state: NotSet,
                required: false,
            },
        },
    ),
)

---- test_nested_with_any_case_mode stdout ----
[toml-pretty-deser/tests/basic.rs:1028:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuterAliased {
            nested: TomlValue {
                value: None,
                state: NotSet,
                required: false,
            },
        },
    ),
)

failures:
    test_nested_happy
    test_nested_happy_half
    test_nested_lower_failure
    test_nested_with_alias
    test_nested_with_any_case_mode
    test_two_errors_pretty
    test_two_level_nested_happy
    test_two_level_nested_inline_table
    test_two_level_nested_missing_inner
    test_two_level_nested_missing_inner_field
    test_two_level_nested_with_optional_nested

test result: FAILED. 27 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
