*** toml-pretty-deser/src/lib.rs:1308:13: delete match arm toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) in <impl FromTomlItem for TomlValue<toml_edit::Item>>::from_toml_item

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) in <impl FromTomlItem for TomlValue<toml_edit::Item>>::from_toml_item
@@ -1300,25 +1300,17 @@
             },
             toml_edit::Item::Table(table) => TomlValue {
                 required: true,
                 value: Some(toml_edit::Item::Table(table.clone())),
                 state: TomlValueState::Ok {
                     span: table.span().unwrap_or(parent_span.clone()),
                 },
             },
-            toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) => TomlValue {
-                required: true,
-                value: Some(toml_edit::Item::Value(toml_edit::Value::InlineTable(
-                    table.clone(),
-                ))),
-                state: TomlValueState::Ok {
-                    span: table.span().unwrap_or(parent_span.clone()),
-                },
-            },
+             /* ~ changed by cargo-mutants ~ */
             _ => TomlValue {
                 required: true,
                 value: Some(item.clone()),
                 state: TomlValueState::Ok {
                     span: item.span().unwrap_or(parent_span.clone()),
                 },
             },
         }

*** result: Success
