*** toml-pretty-deser/src/lib.rs:1339:13: delete match arm toml_edit::Item::None in <impl FromTomlItem for TomlValue<Vec<toml_edit::Item>>>::from_toml_item

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm toml_edit::Item::None in <impl FromTomlItem for TomlValue<Vec<toml_edit::Item>>>::from_toml_item
@@ -1331,24 +1331,17 @@
 
 impl FromTomlItem for TomlValue<Vec<toml_edit::Item>> {
     fn is_optional() -> bool {
         true
     }
 
     fn from_toml_item(item: &toml_edit::Item, parent_span: Range<usize>) -> Self {
         match item {
-            toml_edit::Item::None => TomlValue {
-                value: None,
-                required: true,
-                state: TomlValueState::Missing {
-                    key: "".to_string(),
-                    parent_span,
-                },
-            },
+             /* ~ changed by cargo-mutants ~ */
             toml_edit::Item::ArrayOfTables(array) => {
                 let items: Vec<toml_edit::Item> = array
                     .iter()
                     .map(|table| toml_edit::Item::Table(table.clone()))
                     .collect();
                 TomlValue {
                     required: true,
                     value: Some(items),

*** result: Success
