*** toml-pretty-deser/src/lib.rs:1343:13: delete match arm toml_edit::Item::ArrayOfTables(array) in <impl FromTomlItem for TomlValue<Vec<toml_edit::Item>>>::from_toml_item

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm toml_edit::Item::ArrayOfTables(array) in <impl FromTomlItem for TomlValue<Vec<toml_edit::Item>>>::from_toml_item
@@ -1335,29 +1335,17 @@
             toml_edit::Item::None => TomlValue {
                 value: None,
                 required: true,
                 state: TomlValueState::Missing {
                     key: "".to_string(),
                     parent_span,
                 },
             },
-            toml_edit::Item::ArrayOfTables(array) => {
-                let items: Vec<toml_edit::Item> = array
-                    .iter()
-                    .map(|table| toml_edit::Item::Table(table.clone()))
-                    .collect();
-                TomlValue {
-                    required: true,
-                    value: Some(items),
-                    state: TomlValueState::Ok {
-                        span: array.span().unwrap_or(parent_span.clone()),
-                    },
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             toml_edit::Item::Value(toml_edit::Value::Array(array)) => {
                 // Also support regular arrays with inline tables
                 let items: Vec<toml_edit::Item> = array
                     .iter()
                     .map(|val| toml_edit::Item::Value(val.clone()))
                     .collect();
                 TomlValue {
                     required: true,

---- test_nested_happy stdout ----
[toml-pretty-deser/tests/basic.rs:463:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuter {
            nested: TomlValue {
                value: Some(
                    PartialNested {
                        name: TomlValue {
                            value: Some(
                                "a",
                            ),
                            state: Ok {
                                span: 119..122,

failures:
    test_nested_happy

test result: FAILED. 36 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
