*** toml-pretty-deser/src/lib.rs:1437:13: delete match arm TomlValueState::Ok{span} in <impl FromTomlItem for TomlValue<Option<toml_edit::Item>>>::from_toml_item

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Ok{span} in <impl FromTomlItem for TomlValue<Option<toml_edit::Item>>>::from_toml_item
@@ -1429,21 +1429,17 @@
     fn is_optional() -> bool {
         false
     }
 
     fn from_toml_item(item: &toml_edit::Item, parent_span: Range<usize>) -> Self {
         let mut res: TomlValue<toml_edit::Item> = FromTomlItem::from_toml_item(item, parent_span);
         res.required = false;
         match res.state {
-            TomlValueState::Ok { span } => TomlValue {
-                required: false,
-                value: Some(res.value),
-                state: TomlValueState::Ok { span },
-            },
+             /* ~ changed by cargo-mutants ~ */
             TomlValueState::Missing { .. } => TomlValue {
                 required: false,
                 value: Some(None),
                 state: TomlValueState::Ok { span: 0..0 },
             },
             _ => TomlValue {
                 value: None,
                 required: false,

---- test_nested_happy stdout ----
[toml-pretty-deser/tests/basic.rs:468:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuter {
            nested: TomlValue {
                value: Some(
                    PartialNested {
                        name: TomlValue {
                            value: Some(
                                "a",
                            ),
                            state: Ok {
                                span: 119..122,

---- test_two_level_nested_inline_table stdout ----
[toml-pretty-deser/tests/basic.rs:672:5] &result = Err(
    StillIncomplete(
        [],
        PartialRoot {
            level1: TomlValue {
                value: Some(
                    PartialLevel1 {
                        name: TomlValue {
                            value: Some(
                                "inline_l1",
                            ),
                            state: Ok {
                                span: 39..50,

---- test_two_level_nested_happy stdout ----
[toml-pretty-deser/tests/basic.rs:614:5] &result = Err(
    StillIncomplete(
        [],
        PartialRoot {
            level1: TomlValue {
                value: Some(
                    PartialLevel1 {
                        name: TomlValue {
                            value: Some(
                                "level1_name",
                            ),
                            state: Ok {
                                span: 37..50,

failures:
    test_nested_happy
    test_nested_lower_failure
    test_two_level_nested_happy
    test_two_level_nested_inline_table
    test_two_level_nested_with_optional_nested

test result: FAILED. 33 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
