*** toml-pretty-deser/src/lib.rs:1442:13: delete match arm TomlValueState::Missing{..} in <impl FromTomlItem for TomlValue<Option<toml_edit::Item>>>::from_toml_item

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Missing{..} in <impl FromTomlItem for TomlValue<Option<toml_edit::Item>>>::from_toml_item
@@ -1434,21 +1434,17 @@
         let mut res: TomlValue<toml_edit::Item> = FromTomlItem::from_toml_item(item, parent_span);
         res.required = false;
         match res.state {
             TomlValueState::Ok { span } => TomlValue {
                 required: false,
                 value: Some(res.value),
                 state: TomlValueState::Ok { span },
             },
-            TomlValueState::Missing { .. } => TomlValue {
-                required: false,
-                value: Some(None),
-                state: TomlValueState::Ok { span: 0..0 },
-            },
+             /* ~ changed by cargo-mutants ~ */
             _ => TomlValue {
                 value: None,
                 required: false,
                 state: res.state,
             },
         }
     }
 }

*** result: Success
