*** toml-pretty-deser/src/lib.rs:151:9: replace <impl AsEnum<E> for TomlValue<String>>::as_enum -> TomlValue<E> with TomlValue::from(Default::default())

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace <impl AsEnum<E> for TomlValue<String>>::as_enum -> TomlValue<E> with TomlValue::from(Default::default())
@@ -143,65 +143,17 @@
 }
 
 pub trait AsEnum<E>: Sized {
     fn as_enum(self) -> TomlValue<E>;
 }
 
 impl<E: StringNamedEnum> AsEnum<E> for TomlValue<String> {
     fn as_enum(self) -> TomlValue<E> {
-        match &self.state {
-            TomlValueState::Ok { span } => {
-                if let Some(ref s) = self.value {
-                    match E::from_str(s) {
-                        Some(enum_val) => TomlValue {
-                            value: Some(enum_val),
-                            required: self.required,
-                            state: TomlValueState::Ok { span: span.clone() },
-                        },
-                        None => {
-                            let valid_names = E::all_variant_names().join(", ");
-                            TomlValue {
-                                value: None,
-                                required: self.required,
-                                state: TomlValueState::ValidationFailed {
-                                    span: span.clone(),
-                                    message: format!(
-                                        "Invalid enum variant '{}'. Valid variants are: {}",
-                                        s, valid_names
-                                    ),
-                                },
-                            }
-                        }
-                    }
-                } else {
-                    TomlValue {
-                        value: None,
-                        required: self.required,
-                        state: TomlValueState::ValidationFailed {
-                            span: span.clone(),
-                            message: "Cannot convert empty value to enum".to_string(),
-                        },
-                    }
-                }
-            }
-            TomlValueState::Missing { key, parent_span } => TomlValue {
-                value: None,
-                required: self.required,
-                state: TomlValueState::Missing {
-                    key: key.clone(),
-                    parent_span: parent_span.clone(),
-                },
-            },
-            _ => TomlValue {
-                value: None,
-                required: self.required,
-                state: self.state.clone(),
-            },
-        }
+        TomlValue::from(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<E: StringNamedEnum> AsEnum<Option<E>> for TomlValue<Option<String>> {
     fn as_enum(self) -> TomlValue<Option<E>> {
         match &self.state {
             TomlValueState::Ok { span } => {
                 if let Some(ref opt_s) = self.value {

---- test_enum_happy_path stdout ----
[toml-pretty-deser/tests/basic.rs:341:5] &result = Err(
    StillIncomplete(
        [],
        PartialEnumOutput {
            an_enum: TomlValue {
                value: None,
                state: NotSet,
                required: false,
            },
            opt_enum: TomlValue {
                value: Some(
                    Some(
                        TwoThree,

---- test_enum_invalid_variant stdout ----
[toml-pretty-deser/tests/basic.rs:386:5] &result = Err(
    StillIncomplete(
        [],
        PartialEnumOutput {
            an_enum: TomlValue {
                value: None,
                state: NotSet,
                required: false,
            },
            opt_enum: TomlValue {
                value: Some(
                    None,
                ),

---- test_enum_optional_missing stdout ----
[toml-pretty-deser/tests/basic.rs:367:5] &result = Err(
    StillIncomplete(
        [],
        PartialEnumOutput {
            an_enum: TomlValue {
                value: None,
                state: NotSet,
                required: false,
            },
            opt_enum: TomlValue {
                value: Some(
                    None,
                ),

failures:
    test_enum_happy_path
    test_enum_invalid_variant
    test_enum_missing_required
    test_enum_optional_missing

test result: FAILED. 33 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
