*** toml-pretty-deser/src/lib.rs:152:13: delete match arm TomlValueState::Ok{span} in <impl AsEnum<E> for TomlValue<String>>::as_enum

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Ok{span} in <impl AsEnum<E> for TomlValue<String>>::as_enum
@@ -144,50 +144,17 @@
 
 pub trait AsEnum<E>: Sized {
     fn as_enum(self) -> TomlValue<E>;
 }
 
 impl<E: StringNamedEnum> AsEnum<E> for TomlValue<String> {
     fn as_enum(self) -> TomlValue<E> {
         match &self.state {
-            TomlValueState::Ok { span } => {
-                if let Some(ref s) = self.value {
-                    match E::from_str(s) {
-                        Some(enum_val) => TomlValue {
-                            value: Some(enum_val),
-                            required: self.required,
-                            state: TomlValueState::Ok { span: span.clone() },
-                        },
-                        None => {
-                            let valid_names = E::all_variant_names().join(", ");
-                            TomlValue {
-                                value: None,
-                                required: self.required,
-                                state: TomlValueState::ValidationFailed {
-                                    span: span.clone(),
-                                    message: format!(
-                                        "Invalid enum variant '{}'. Valid variants are: {}",
-                                        s, valid_names
-                                    ),
-                                },
-                            }
-                        }
-                    }
-                } else {
-                    TomlValue {
-                        value: None,
-                        required: self.required,
-                        state: TomlValueState::ValidationFailed {
-                            span: span.clone(),
-                            message: "Cannot convert empty value to enum".to_string(),
-                        },
-                    }
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             TomlValueState::Missing { key, parent_span } => TomlValue {
                 value: None,
                 required: self.required,
                 state: TomlValueState::Missing {
                     key: key.clone(),
                     parent_span: parent_span.clone(),
                 },
             },

---- test_enum_happy_path stdout ----

thread 'test_enum_happy_path' (2401550) panicked at toml-pretty-deser/src/lib.rs:1588:53:
called `Option::unwrap()` on a `None` value

---- test_enum_optional_missing stdout ----

thread 'test_enum_optional_missing' (2401553) panicked at toml-pretty-deser/src/lib.rs:1588:53:
called `Option::unwrap()` on a `None` value

---- test_enum_invalid_variant stdout ----

thread 'test_enum_invalid_variant' (2401551) panicked at toml-pretty-deser/src/lib.rs:1588:53:
called `Option::unwrap()` on a `None` value

failures:
    test_enum_happy_path
    test_enum_invalid_variant
    test_enum_optional_missing

test result: FAILED. 35 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
