*** toml-pretty-deser/src/lib.rs:1598:9: replace TomlValue<T>::has_value -> bool with false

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlValue<T>::has_value -> bool with false
@@ -1590,17 +1590,17 @@
             state: TomlValueState::NotSet,
             required: false,
         }
     }
 }
 
 impl<T> TomlValue<T> {
     pub fn has_value(&self) -> bool {
-        matches!(self.state, TomlValueState::Ok { .. })
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn into_option(self) -> Option<T> {
         match self.state {
             TomlValueState::Ok { .. } => self.value,
             _ => None,
         }
     }

---- test_alias_exact_mode stdout ----
[toml-pretty-deser/tests/basic.rs:715:5] &result = Err(
    StillIncomplete(
        [],
        PartialAliasedOutput {
            my_name: TomlValue {
                value: Some(
                    "using alias",
                ),
                state: Ok {
                    span: 21..34,
                },
                required: true,
            },

---- test_alias_with_any_case_mode stdout ----
[toml-pretty-deser/tests/basic.rs:906:5] &result = Err(
    StillIncomplete(
        [],
        PartialAliasedOutput {
            my_name: TomlValue {
                value: Some(
                    "alias match",
                ),
                state: Ok {
                    span: 18..31,
                },
                required: true,
            },

---- test_any_case_mode_upper_camel stdout ----
[toml-pretty-deser/tests/basic.rs:832:5] &result = Err(
    StillIncomplete(
        [],
        PartialCaseOutput {
            my_field: TomlValue {
                value: Some(
                    "upper camel",
                ),
                state: Ok {
                    span: 19..32,
                },
                required: true,
            },

failures:
    test_alias_exact_mode
    test_alias_with_any_case_mode
    test_any_case_mode_camel
    test_any_case_mode_kebab
    test_any_case_mode_shouty
    test_any_case_mode_snake
    test_any_case_mode_train
    test_any_case_mode_upper_camel
    test_arrays_and_nested
    test_arrays_with_optional
    test_complex_mixed_case
    test_enum_happy_path

test result: FAILED. 15 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
