*** toml-pretty-deser/src/lib.rs:1610:13: delete match arm TomlValueState::Ok{..} in TomlValue<T>::as_ref

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Ok{..} in TomlValue<T>::as_ref
@@ -1602,17 +1602,17 @@
         match self.state {
             TomlValueState::Ok { .. } => self.value,
             _ => None,
         }
     }
 
     pub fn as_ref(&self) -> Option<&T> {
         match self.state {
-            TomlValueState::Ok { .. } => self.value.as_ref(),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         }
     }
 
     pub fn unwrap(self) -> T {
         match self.state {
             TomlValueState::Ok { .. } => self.value.unwrap(),
             _ => panic!("Called unwrap on a TomlValue that is not Ok"),

---- test_complex_mixed_case_key_reused stdout ----
[toml-pretty-deser/tests/basic.rs:1001:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        API_KEY = 'shouty alias'\n        htmlparser= '23'\n        HTMLPARSER = 'consecutive caps'\n        api-key = 24\n        getHTTPResponse = 42\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..16,
                            msg: "Unknown key: API_KEY",
                        },

---- test_nested_happy_half stdout ----
[toml-pretty-deser/tests/basic.rs:488:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [nested]\n            name = 'a'\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..17,
                            msg: "Missing required key: value",
                        },

---- test_two_level_nested_missing_inner stdout ----
[toml-pretty-deser/tests/basic.rs:627:5] &result = Err(
    StillIncomplete(
        [],
        PartialRoot {
            level1: TomlValue {
                value: Some(
                    PartialLevel1 {
                        name: TomlValue {
                            value: Some(
                                "l1",
                            ),
                            state: Ok {
                                span: 37..41,

failures:
    test_complex_mixed_case_key_reused
    test_nested_happy_half
    test_two_level_nested_missing_inner

test result: FAILED. 34 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
