*** toml-pretty-deser/src/lib.rs:1621:13: delete match arm TomlValueState::Ok{..} in TomlValue<T>::unwrap

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Ok{..} in TomlValue<T>::unwrap
@@ -1613,17 +1613,17 @@
         match self.state {
             TomlValueState::Ok { .. } => self.value.as_ref(),
             _ => None,
         }
     }
 
     pub fn unwrap(self) -> T {
         match self.state {
-            TomlValueState::Ok { .. } => self.value.unwrap(),
+             /* ~ changed by cargo-mutants ~ */
             _ => panic!("Called unwrap on a TomlValue that is not Ok"),
         }
     }
 
     pub fn register_error(&self, errors: &Rc<RefCell<Vec<AnnotatedError>>>) {
         match &self.state {
             TomlValueState::NotSet => {}
             TomlValueState::Missing { key, parent_span } => {

---- test_alias_exact_mode stdout ----

thread 'test_alias_exact_mode' (2419462) panicked at toml-pretty-deser/src/lib.rs:1622:18:
Called unwrap on a TomlValue that is not Ok

---- test_alias_with_any_case_mode stdout ----

thread 'test_alias_with_any_case_mode' (2419464) panicked at toml-pretty-deser/src/lib.rs:1622:18:
Called unwrap on a TomlValue that is not Ok

---- test_any_case_mode_camel stdout ----

thread 'test_any_case_mode_camel' (2419465) panicked at toml-pretty-deser/src/lib.rs:1622:18:
Called unwrap on a TomlValue that is not Ok

failures:
    test_alias_exact_mode
    test_alias_with_any_case_mode
    test_any_case_mode_camel
    test_any_case_mode_kebab
    test_any_case_mode_shouty
    test_any_case_mode_snake
    test_any_case_mode_train
    test_any_case_mode_upper_camel
    test_arrays
    test_arrays_with_optional
    test_complex_mixed_case
    test_enum_happy_path

test result: FAILED. 16 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
