*** toml-pretty-deser/src/lib.rs:1627:9: replace TomlValue<T>::register_error with ()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlValue<T>::register_error with ()
@@ -1619,58 +1619,17 @@
     pub fn unwrap(self) -> T {
         match self.state {
             TomlValueState::Ok { .. } => self.value.unwrap(),
             _ => panic!("Called unwrap on a TomlValue that is not Ok"),
         }
     }
 
     pub fn register_error(&self, errors: &Rc<RefCell<Vec<AnnotatedError>>>) {
-        match &self.state {
-            TomlValueState::NotSet => {}
-            TomlValueState::Missing { key, parent_span } => {
-                if self.required {
-                    errors.borrow_mut().push(AnnotatedError::placed(
-                        parent_span.clone(),
-                        &format!("Missing required key: {}", key),
-                        "This key is required but was not found in the TOML document.",
-                    ));
-                }
-            }
-            TomlValueState::MultiDefined { key, spans } => {
-                let mut err = AnnotatedError::placed(
-                    spans[0].clone(),
-                    "Key/alias conflict (defined multiple times)",
-                    &format!("Use only one of the keys involved. Canonical is '{}'", key),
-                );
-                for span in spans.iter().skip(1) {
-                    err.add_span(span.clone(), "Also defined here");
-                }
-                errors.borrow_mut().push(err);
-            }
-            TomlValueState::WrongType {
-                span,
-                expected,
-                found,
-            } => {
-                errors.borrow_mut().push(AnnotatedError::placed(
-                    span.clone(),
-                    &format!("Wrong type: expected {}, found {}", expected, found),
-                    "The value has the wrong type.",
-                ));
-            }
-            TomlValueState::ValidationFailed { span, message } => {
-                errors.borrow_mut().push(AnnotatedError::placed(
-                    span.clone(),
-                    &format!("Validation failed: {}", message),
-                    "The value failed validation checks.",
-                ));
-            }
-            TomlValueState::Ok { .. } => {}
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn verify<F>(self, verification_func: F) -> TomlValue<T>
     where
         F: FnOnce(&T) -> Result<(), String>,
     {
         match &self.state {
             TomlValueState::Ok { span } => match verification_func(self.value.as_ref().unwrap()) {

---- test_array_wrong_element_type stdout ----
[toml-pretty-deser/tests/basic.rs:303:5] &result = Err(
    StillIncomplete(
        [],
        PartialComplexOutput {
            items: TomlValue {
                value: None,
                state: ValidationFailed {
                    span: 21..30,
                    message: "Array contains invalid elements",
                },
                required: true,
            },
            numbers: TomlValue {

---- test_enum_missing_required stdout ----
[toml-pretty-deser/tests/basic.rs:407:5] &result = Err(
    StillIncomplete(
        [],
        PartialEnumOutput {
            an_enum: TomlValue {
                value: None,
                state: Missing {
                    key: "an_enum",
                    parent_span: 0..0,
                },
                required: true,
            },
            opt_enum: TomlValue {

---- test_enum_invalid_variant stdout ----
[toml-pretty-deser/tests/basic.rs:387:5] &result = Err(
    StillIncomplete(
        [],
        PartialEnumOutput {
            an_enum: TomlValue {
                value: None,
                state: ValidationFailed {
                    span: 23..39,
                    message: "Invalid enum variant 'InvalidVariant'. Valid variants are: One, TwoThree, Four",
                },
                required: true,
            },
            opt_enum: TomlValue {

failures:
    test_array_wrong_element_type
    test_enum_invalid_variant
    test_enum_missing_required
    test_missing
    test_nested_happy_half
    test_nested_lower_failure
    test_range_validation
    test_two_errors_pretty
    test_two_level_nested_missing_inner_field
    test_validation_failure
    test_vec_missing
    test_wrong_type

test result: FAILED. 26 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
