*** toml-pretty-deser/src/lib.rs:1672:13: delete match arm TomlValueState::Ok{span} in TomlValue<T>::verify

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Ok{span} in TomlValue<T>::verify
@@ -1664,27 +1664,17 @@
         }
     }
 
     pub fn verify<F>(self, verification_func: F) -> TomlValue<T>
     where
         F: FnOnce(&T) -> Result<(), String>,
     {
         match &self.state {
-            TomlValueState::Ok { span } => match verification_func(self.value.as_ref().unwrap()) {
-                Ok(()) => self,
-                Err(msg) => TomlValue {
-                    value: None,
-                    required: self.required,
-                    state: TomlValueState::ValidationFailed {
-                        span: span.clone(),
-                        message: msg,
-                    },
-                },
-            },
+             /* ~ changed by cargo-mutants ~ */
             _ => self,
         }
     }
 
     pub fn or_default(self, default: T) -> TomlValue<T> {
         match &self.state {
             TomlValueState::Missing { .. } => TomlValue {
                 value: Some(default),

---- test_validation_failure stdout ----
[toml-pretty-deser/tests/basic.rs:161:5] &result = Ok(
    Output {
        a_u8: 255,
        a_i64: -123,
        a_f64: 3.14,
        a_string: "Hello, World!",
        a_bool: true,
        opt_a_u8: Some(
            128,
        ),
        opt_a_i64: Some(
            -456,
        ),

failures:
    test_validation_failure

test result: FAILED. 36 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
