*** toml-pretty-deser/src/lib.rs:1675:9: replace TomlValue<T>::verify -> TomlValue<T> with TomlValue::from(Default::default())

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlValue<T>::verify -> TomlValue<T> with TomlValue::from(Default::default())
@@ -1667,30 +1667,17 @@
             TomlValueState::Ok { .. } => {}
         }
     }
 
     pub fn verify<F>(self, verification_func: F) -> TomlValue<T>
     where
         F: FnOnce(&T) -> Result<(), String>,
     {
-        match &self.state {
-            TomlValueState::Ok { span } => match verification_func(self.value.as_ref().unwrap()) {
-                Ok(()) => self,
-                Err(msg) => TomlValue {
-                    value: None,
-                    required: self.required,
-                    state: TomlValueState::ValidationFailed {
-                        span: span.clone(),
-                        message: msg,
-                    },
-                },
-            },
-            _ => self,
-        }
+        TomlValue::from(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn or_default(self, default: T) -> TomlValue<T> {
         match &self.state {
             TomlValueState::Missing { .. } => TomlValue {
                 value: Some(default),
                 required: false,
                 state: TomlValueState::Ok { span: 0..0 },

---- test_happy_path stdout ----
[toml-pretty-deser/tests/basic.rs:59:5] &result = Err(
    StillIncomplete(
        [],
        PartialOutput {
            a_u8: TomlValue {
                value: Some(
                    255,
                ),
                state: Ok {
                    span: 20..23,
                },
                required: true,
            },

---- test_optional_missing stdout ----
[toml-pretty-deser/tests/basic.rs:128:5] &result = Err(
    StillIncomplete(
        [],
        PartialOutput {
            a_u8: TomlValue {
                value: Some(
                    255,
                ),
                state: Ok {
                    span: 20..23,
                },
                required: true,
            },

---- test_validation_failure stdout ----
[toml-pretty-deser/tests/basic.rs:161:5] &result = Err(
    StillIncomplete(
        [],
        PartialOutput {
            a_u8: TomlValue {
                value: Some(
                    255,
                ),
                state: Ok {
                    span: 20..23,
                },
                required: true,
            },

failures:
    test_happy_path
    test_optional_missing
    test_validation_failure

test result: FAILED. 35 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
