*** toml-pretty-deser/src/lib.rs:1689:13: delete match arm TomlValueState::Missing{..} in TomlValue<T>::or_default

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Missing{..} in TomlValue<T>::or_default
@@ -1681,21 +1681,17 @@
                 },
             },
             _ => self,
         }
     }
 
     pub fn or_default(self, default: T) -> TomlValue<T> {
         match &self.state {
-            TomlValueState::Missing { .. } => TomlValue {
-                value: Some(default),
-                required: false,
-                state: TomlValueState::Ok { span: 0..0 },
-            },
+             /* ~ changed by cargo-mutants ~ */
             _ => self,
         }
     }
 }
 
 pub trait AsNested<P>: Sized {
     fn as_nested(
         self,

---- test_optional_missing stdout ----
[toml-pretty-deser/tests/basic.rs:128:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 0..0,
                            msg: "Missing required key: defaulted_i16",
                        },

failures:
    test_optional_missing

test result: FAILED. 36 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
