*** toml-pretty-deser/src/lib.rs:1692:9: replace TomlValue<T>::or_default -> TomlValue<T> with TomlValue::from(Default::default())

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlValue<T>::or_default -> TomlValue<T> with TomlValue::from(Default::default())
@@ -1684,24 +1684,17 @@
                     },
                 },
             },
             _ => self,
         }
     }
 
     pub fn or_default(self, default: T) -> TomlValue<T> {
-        match &self.state {
-            TomlValueState::Missing { .. } => TomlValue {
-                value: Some(default),
-                required: false,
-                state: TomlValueState::Ok { span: 0..0 },
-            },
-            _ => self,
-        }
+        TomlValue::from(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub trait AsNested<P>: Sized {
     fn as_nested(
         self,
         errors: &Rc<RefCell<Vec<AnnotatedError>>>,
         mode: FieldMatchMode,

---- test_happy_path stdout ----
[toml-pretty-deser/tests/basic.rs:59:5] &result = Err(
    StillIncomplete(
        [],
        PartialOutput {
            a_u8: TomlValue {
                value: Some(
                    255,
                ),
                state: Ok {
                    span: 20..23,
                },
                required: true,
            },

---- test_optional_missing stdout ----
[toml-pretty-deser/tests/basic.rs:128:5] &result = Err(
    StillIncomplete(
        [],
        PartialOutput {
            a_u8: TomlValue {
                value: Some(
                    255,
                ),
                state: Ok {
                    span: 20..23,
                },
                required: true,
            },

failures:
    test_happy_path
    test_optional_missing

test result: FAILED. 36 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
