*** toml-pretty-deser/src/lib.rs:1720:25: delete match arm toml_edit::Item::Table(table) in <impl AsNested<P> for TomlValue<toml_edit::Item>>::as_nested

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm toml_edit::Item::Table(table) in <impl AsNested<P> for TomlValue<toml_edit::Item>>::as_nested
@@ -1712,44 +1712,17 @@
         self,
         errors: &Rc<RefCell<Vec<AnnotatedError>>>,
         mode: FieldMatchMode,
     ) -> TomlValue<P> {
         match &self.state {
             TomlValueState::Ok { span } => {
                 if let Some(ref item) = self.value {
                     match item {
-                        toml_edit::Item::Table(table) => {
-                            let error_count_before = errors.borrow().len();
-                            let mut helper = TomlHelper::new(table, errors.clone(), mode);
-                            let partial =
-                                P::from_toml_table(&mut helper, &()).verify(&mut helper, &());
-                            helper.deny_unknown();
-
-                            // Collect any new errors from the nested deserialization
-                            let error_count_after = errors.borrow().len();
-
-                            if error_count_after > error_count_before {
-                                // There were errors during nested deserialization
-                                TomlValue {
-                                    value: Some(partial),
-                                    required: self.required,
-                                    state: TomlValueState::ValidationFailed {
-                                        span: span.clone(),
-                                        message: "Nested struct has errors".to_string(),
-                                    },
-                                }
-                            } else {
-                                TomlValue {
-                                    value: Some(partial),
-                                    required: self.required,
-                                    state: TomlValueState::Ok { span: span.clone() },
-                                }
-                            }
-                        }
+                         /* ~ changed by cargo-mutants ~ */
                         toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) => {
                             let error_count_before = errors.borrow().len();
                             let mut helper = TomlHelper::new_inline(table, errors.clone(), mode);
                             let partial =
                                 P::from_toml_table(&mut helper, &()).verify(&mut helper, &());
                             helper.deny_unknown();
 
                             let error_count_after = errors.borrow().len();

---- test_nested_happy_half stdout ----
[toml-pretty-deser/tests/basic.rs:488:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuter {
            nested: TomlValue {
                value: None,
                state: WrongType {
                    span: 9..17,
                    expected: "table or inline table",
                    found: "other type",
                },
                required: true,
            },

---- test_nested_with_any_case_mode stdout ----
[toml-pretty-deser/tests/basic.rs:954:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuterAliased {
            nested: TomlValue {
                value: None,
                state: WrongType {
                    span: 9..17,
                    expected: "table or inline table",
                    found: "other type",
                },
                required: true,
            },

---- test_two_errors_pretty stdout ----
[toml-pretty-deser/tests/basic.rs:669:5] &result = Err(
    StillIncomplete(
        [],
        PartialRoot {
            level1: TomlValue {
                value: None,
                state: WrongType {
                    span: 9..17,
                    expected: "table or inline table",
                    found: "other type",
                },
                required: true,
            },

failures:
    test_nested_happy
    test_nested_happy_half
    test_nested_with_alias
    test_nested_with_any_case_mode
    test_two_errors_pretty
    test_two_level_nested_happy
    test_two_level_nested_missing_inner
    test_two_level_nested_missing_inner_field
    test_two_level_nested_with_optional_nested

test result: FAILED. 28 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
