*** toml-pretty-deser/src/lib.rs:1721:13: delete match arm TomlValueState::Ok{span} in <impl AsNested<P> for TomlValue<toml_edit::Item>>::as_nested

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Ok{span} in <impl AsNested<P> for TomlValue<toml_edit::Item>>::as_nested
@@ -1713,90 +1713,17 @@
     P: FromTomlTable<()> + VerifyFromToml<()>,
 {
     fn as_nested(
         self,
         errors: &Rc<RefCell<Vec<AnnotatedError>>>,
         mode: FieldMatchMode,
     ) -> TomlValue<P> {
         match &self.state {
-            TomlValueState::Ok { span } => {
-                if let Some(ref item) = self.value {
-                    match item {
-                        toml_edit::Item::Table(table) => {
-                            let mut helper = TomlHelper::new(table, errors.clone(), mode);
-                            let partial =
-                                P::from_toml_table(&mut helper, &()).verify(&mut helper, &());
-                            helper.deny_unknown();
-
-                            // Collect any new errors from the nested deserialization
-
-                            if !partial.can_concrete() {
-                                // There were errors during nested deserialization
-                                TomlValue {
-                                    value: Some(partial),
-                                    required: self.required,
-                                    state: TomlValueState::ValidationFailed {
-                                        span: span.clone(),
-                                        message: "Nested struct has errors".to_string(),
-                                    },
-                                }
-                            } else {
-                                TomlValue {
-                                    value: Some(partial),
-                                    required: self.required,
-                                    state: TomlValueState::Ok { span: span.clone() },
-                                }
-                            }
-                        }
-                        toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) => {
-                            let mut helper = TomlHelper::new_inline(table, errors.clone(), mode);
-                            let partial =
-                                P::from_toml_table(&mut helper, &()).verify(&mut helper, &());
-                            helper.deny_unknown();
-
-
-                            if !partial.can_concrete() {
-                                TomlValue {
-                                    value: Some(partial),
-                                    required: self.required,
-                                    state: TomlValueState::ValidationFailed {
-                                        span: span.clone(),
-                                        message: "Nested struct has errors".to_string(),
-                                    },
-                                }
-                            } else {
-                                TomlValue {
-                                    value: Some(partial),
-                                    required: self.required,
-                                    state: TomlValueState::Ok { span: span.clone() },
-                                }
-                            }
-                        }
-                        _ => TomlValue {
-                            value: None,
-                            required: self.required,
-                            state: TomlValueState::WrongType {
-                                span: span.clone(),
-                                expected: "table or inline table",
-                                found: "other type",
-                            },
-                        },
-                    }
-                } else {
-                    TomlValue {
-                        value: None,
-                        required: self.required,
-                        state: TomlValueState::ValidationFailed {
-                            span: span.clone(),
-                            message: "Cannot convert empty value to nested struct".to_string(),
-                        },
-                    }
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             TomlValueState::Missing { key, parent_span } => TomlValue {
                 value: None,
                 required: self.required,
                 state: TomlValueState::Missing {
                     key: key.clone(),
                     parent_span: parent_span.clone(),
                 },
             },

---- test_nested_with_alias stdout ----
[toml-pretty-deser/tests/basic.rs:1012:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuterAliased {
            nested: TomlValue {
                value: None,
                state: Ok {
                    span: 9..17,
                },
                required: true,
            },
        },
    ),

---- test_nested_happy_half stdout ----
[toml-pretty-deser/tests/basic.rs:493:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuter {
            nested: TomlValue {
                value: None,
                state: Ok {
                    span: 9..17,
                },
                required: true,
            },
            inline_nested: TomlValue {
                value: None,

---- test_nested_happy stdout ----
[toml-pretty-deser/tests/basic.rs:468:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuter {
            nested: TomlValue {
                value: None,
                state: Ok {
                    span: 91..99,
                },
                required: true,
            },
            inline_nested: TomlValue {
                value: None,

failures:
    test_nested_happy
    test_nested_happy_half
    test_nested_lower_failure
    test_nested_with_alias
    test_nested_with_any_case_mode
    test_two_errors_pretty
    test_two_level_nested_happy
    test_two_level_nested_inline_table
    test_two_level_nested_missing_inner
    test_two_level_nested_missing_inner_field
    test_two_level_nested_with_optional_nested

test result: FAILED. 27 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
