*** toml-pretty-deser/src/lib.rs:1750:25: delete match arm toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) in <impl AsNested<P> for TomlValue<toml_edit::Item>>::as_nested

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) in <impl AsNested<P> for TomlValue<toml_edit::Item>>::as_nested
@@ -1742,40 +1742,17 @@
                             } else {
                                 TomlValue {
                                     value: Some(partial),
                                     required: self.required,
                                     state: TomlValueState::Ok { span: span.clone() },
                                 }
                             }
                         }
-                        toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) => {
-                            let mut helper = TomlHelper::new_inline(table, errors.clone(), mode);
-                            let partial =
-                                P::from_toml_table(&mut helper, &()).verify(&mut helper, &());
-                            helper.deny_unknown();
-
-
-                            if !partial.can_concrete() {
-                                TomlValue {
-                                    value: Some(partial),
-                                    required: self.required,
-                                    state: TomlValueState::ValidationFailed {
-                                        span: span.clone(),
-                                        message: "Nested struct has errors".to_string(),
-                                    },
-                                }
-                            } else {
-                                TomlValue {
-                                    value: Some(partial),
-                                    required: self.required,
-                                    state: TomlValueState::Ok { span: span.clone() },
-                                }
-                            }
-                        }
+                         /* ~ changed by cargo-mutants ~ */
                         _ => TomlValue {
                             value: None,
                             required: self.required,
                             state: TomlValueState::WrongType {
                                 span: span.clone(),
                                 expected: "table or inline table",
                                 found: "other type",
                             },

---- test_nested_happy stdout ----
[toml-pretty-deser/tests/basic.rs:468:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuter {
            nested: TomlValue {
                value: Some(
                    PartialNested {
                        name: TomlValue {
                            value: Some(
                                "a",
                            ),
                            state: Ok {
                                span: 119..122,

---- test_two_level_nested_inline_table stdout ----
[toml-pretty-deser/tests/basic.rs:672:5] &result = Err(
    StillIncomplete(
        [],
        PartialRoot {
            level1: TomlValue {
                value: None,
                state: WrongType {
                    span: 18..214,
                    expected: "table or inline table",
                    found: "other type",
                },
                required: true,
            },

---- test_nested_lower_failure stdout ----
[toml-pretty-deser/tests/basic.rs:534:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 117..119,
                            msg: "Wrong type: expected string, found integer",
                        },

failures:
    test_nested_happy
    test_nested_lower_failure
    test_two_level_nested_inline_table

test result: FAILED. 35 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
