*** toml-pretty-deser/src/lib.rs:1822:13: delete match arm TomlValueState::Ok{span} in <impl AsNested<Option<P>> for TomlValue<Option<toml_edit::Item>>>::as_nested

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Ok{span} in <impl AsNested<Option<P>> for TomlValue<Option<toml_edit::Item>>>::as_nested
@@ -1814,96 +1814,17 @@
     P: FromTomlTable<()> + VerifyFromToml<()>,
 {
     fn as_nested(
         self,
         errors: &Rc<RefCell<Vec<AnnotatedError>>>,
         mode: FieldMatchMode,
     ) -> TomlValue<Option<P>> {
         match &self.state {
-            TomlValueState::Ok { span } => {
-                if let Some(ref opt_item) = self.value {
-                    if let Some(item) = opt_item {
-                        match item {
-                            toml_edit::Item::Table(table) => {
-                                let mut helper = TomlHelper::new(table, errors.clone(), mode);
-                                let partial =
-                                    P::from_toml_table(&mut helper, &()).verify(&mut helper, &());
-                                helper.deny_unknown();
-
-                                if !partial.can_concrete() {
-                                    TomlValue {
-                                        value: Some(Some(partial)),
-                                        required: self.required,
-                                        state: TomlValueState::ValidationFailed {
-                                            span: span.clone(),
-                                            message: "Nested struct has errors".to_string(),
-                                        },
-                                    }
-                                } else {
-                                    TomlValue {
-                                        value: Some(Some(partial)),
-                                        required: self.required,
-                                        state: TomlValueState::Ok { span: span.clone() },
-                                    }
-                                }
-                            }
-                            toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) => {
-                                let mut helper =
-                                    TomlHelper::new_inline(table, errors.clone(), mode);
-                                let partial =
-                                    P::from_toml_table(&mut helper, &()).verify(&mut helper, &());
-                                helper.deny_unknown();
-
-                                if !partial.can_concrete() {
-                                    TomlValue {
-                                        value: Some(Some(partial)),
-                                        required: self.required,
-                                        state: TomlValueState::ValidationFailed {
-                                            span: span.clone(),
-                                            message: "Nested struct has errors".to_string(),
-                                        },
-                                    }
-                                } else {
-                                    TomlValue {
-                                        value: Some(Some(partial)),
-                                        required: self.required,
-                                        state: TomlValueState::Ok { span: span.clone() },
-                                    }
-                                }
-                            }
-                            _ => TomlValue {
-                                value: None,
-                                required: self.required,
-                                state: TomlValueState::WrongType {
-                                    span: span.clone(),
-                                    expected: "table",
-                                    found: "other type",
-                                },
-                            },
-                        }
-                    } else {
-                        // None value is valid for Option<P>
-                        TomlValue {
-                            value: Some(None),
-                            required: self.required,
-                            state: TomlValueState::Ok { span: span.clone() },
-                        }
-                    }
-                } else {
-                    TomlValue {
-                        value: None,
-                        required: self.required,
-                        state: TomlValueState::ValidationFailed {
-                            span: span.clone(),
-                            message: "Cannot convert empty value to nested struct".to_string(),
-                        },
-                    }
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             TomlValueState::Missing {
                 key: _,
                 parent_span,
             } => TomlValue {
                 value: Some(None),
                 required: self.required,
                 state: TomlValueState::Ok {
                     span: parent_span.clone(),

---- test_nested_happy_half stdout ----
[toml-pretty-deser/tests/basic.rs:493:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [nested]\n            name = 'a'\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..17,
                            msg: "Missing required key: value",
                        },

---- test_nested_happy stdout ----
[toml-pretty-deser/tests/basic.rs:468:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuter {
            nested: TomlValue {
                value: Some(
                    PartialNested {
                        name: TomlValue {
                            value: Some(
                                "a",
                            ),
                            state: Ok {
                                span: 119..122,

---- test_two_level_nested_inline_table stdout ----
[toml-pretty-deser/tests/basic.rs:672:5] &result = Err(
    StillIncomplete(
        [],
        PartialRoot {
            level1: TomlValue {
                value: Some(
                    PartialLevel1 {
                        name: TomlValue {
                            value: Some(
                                "inline_l1",
                            ),
                            state: Ok {
                                span: 39..50,

failures:
    test_nested_happy
    test_nested_happy_half
    test_nested_lower_failure
    test_two_level_nested_happy
    test_two_level_nested_inline_table
    test_two_level_nested_with_optional_nested

test result: FAILED. 32 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
