*** toml-pretty-deser/src/lib.rs:1849:29: delete match arm toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) in <impl AsNested<Option<P>> for TomlValue<Option<toml_edit::Item>>>::as_nested

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) in <impl AsNested<Option<P>> for TomlValue<Option<toml_edit::Item>>>::as_nested
@@ -1841,40 +1841,17 @@
                                 } else {
                                     TomlValue {
                                         value: Some(Some(partial)),
                                         required: self.required,
                                         state: TomlValueState::Ok { span: span.clone() },
                                     }
                                 }
                             }
-                            toml_edit::Item::Value(toml_edit::Value::InlineTable(table)) => {
-                                let mut helper =
-                                    TomlHelper::new_inline(table, errors.clone(), mode);
-                                let partial =
-                                    P::from_toml_table(&mut helper, &()).verify(&mut helper, &());
-                                helper.deny_unknown();
-
-                                if !partial.can_concrete() {
-                                    TomlValue {
-                                        value: Some(Some(partial)),
-                                        required: self.required,
-                                        state: TomlValueState::ValidationFailed {
-                                            span: span.clone(),
-                                            message: "Nested struct has errors".to_string(),
-                                        },
-                                    }
-                                } else {
-                                    TomlValue {
-                                        value: Some(Some(partial)),
-                                        required: self.required,
-                                        state: TomlValueState::Ok { span: span.clone() },
-                                    }
-                                }
-                            }
+                             /* ~ changed by cargo-mutants ~ */
                             _ => TomlValue {
                                 value: None,
                                 required: self.required,
                                 state: TomlValueState::WrongType {
                                     span: span.clone(),
                                     expected: "table",
                                     found: "other type",
                                 },

---- test_two_level_nested_inline_table stdout ----
[toml-pretty-deser/tests/basic.rs:672:5] &result = Err(
    StillIncomplete(
        [],
        PartialRoot {
            level1: TomlValue {
                value: Some(
                    PartialLevel1 {
                        name: TomlValue {
                            value: Some(
                                "inline_l1",
                            ),
                            state: Ok {
                                span: 39..50,

failures:
    test_two_level_nested_inline_table

test result: FAILED. 37 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
