*** toml-pretty-deser/src/lib.rs:1931:13: delete match arm TomlValueState::Ok{span} in <impl AsNested<Vec<P>> for TomlValue<Vec<toml_edit::Item>>>::as_nested

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Ok{span} in <impl AsNested<Vec<P>> for TomlValue<Vec<toml_edit::Item>>>::as_nested
@@ -1923,72 +1923,17 @@
     P: FromTomlTable<()> + VerifyFromToml<()>,
 {
     fn as_nested(
         self,
         errors: &Rc<RefCell<Vec<AnnotatedError>>>,
         mode: FieldMatchMode,
     ) -> TomlValue<Vec<P>> {
         match &self.state {
-            TomlValueState::Ok { span } => {
-                if let Some(ref items) = self.value {
-                    let mut results = Vec::with_capacity(items.len());
-
-                    for item in items.iter() {
-                        match item {
-                            toml_edit::Item::Table(table) => {
-                                let mut helper = TomlHelper::new(table, errors.clone(), mode);
-                                let partial =
-                                    P::from_toml_table(&mut helper, &()).verify(&mut helper, &());
-                                helper.deny_unknown();
-
-
-                                results.push(partial);
-                            }
-                            _ => {
-                                // Non-table item in array
-                                errors.borrow_mut().push(AnnotatedError::placed(
-                                    span.clone(),
-                                    "Expected table in array",
-                                    "Only table items are supported in nested struct arrays",
-                                ));
-                            }
-                        }
-                    }
-
-
-                    if results.iter().any(|partial| !partial.can_concrete()) {
-                        // There were errors during nested deserialization
-                        TomlValue {
-                            value: Some(results),
-                            required: self.required,
-                            state: TomlValueState::ValidationFailed {
-                                span: span.clone(),
-                                message: "Array of nested structs has errors".to_string(),
-                            },
-                        }
-                    } else {
-                        TomlValue {
-                            value: Some(results),
-                            required: self.required,
-                            state: TomlValueState::Ok { span: span.clone() },
-                        }
-                    }
-                } else {
-                    TomlValue {
-                        value: None,
-                        required: self.required,
-                        state: TomlValueState::ValidationFailed {
-                            span: span.clone(),
-                            message: "Cannot convert empty value to array of nested structs"
-                                .to_string(),
-                        },
-                    }
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             TomlValueState::Missing { key, parent_span } => TomlValue {
                 value: None,
                 required: self.required,
                 state: TomlValueState::Missing {
                     key: key.clone(),
                     parent_span: parent_span.clone(),
                 },
             },

---- test_nested_lower_failure stdout ----
[toml-pretty-deser/tests/basic.rs:534:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 117..119,
                            msg: "Wrong type: expected string, found integer",
                        },

---- test_nested_happy stdout ----
[toml-pretty-deser/tests/basic.rs:468:5] &result = Err(
    StillIncomplete(
        [],
        PartialOuter {
            nested: TomlValue {
                value: Some(
                    PartialNested {
                        name: TomlValue {
                            value: Some(
                                "a",
                            ),
                            state: Ok {
                                span: 119..122,

failures:
    test_nested_happy
    test_nested_lower_failure

test result: FAILED. 36 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
