*** toml-pretty-deser/src/lib.rs:1944:29: delete match arm toml_edit::Item::Table(table) in <impl AsNested<Vec<P>> for TomlValue<Vec<toml_edit::Item>>>::as_nested

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm toml_edit::Item::Table(table) in <impl AsNested<Vec<P>> for TomlValue<Vec<toml_edit::Item>>>::as_nested
@@ -1936,33 +1936,17 @@
         match &self.state {
             TomlValueState::Ok { span } => {
                 if let Some(ref items) = self.value {
                     let mut results = Vec::with_capacity(items.len());
                     let error_count_before = errors.borrow().len();
 
                     for item in items.iter() {
                         match item {
-                            toml_edit::Item::Table(table) => {
-                                let item_error_count_before = errors.borrow().len();
-                                let mut helper = TomlHelper::new(table, errors.clone(), mode);
-                                let partial =
-                                    P::from_toml_table(&mut helper, &()).verify(&mut helper, &());
-                                helper.deny_unknown();
-
-                                let item_error_count_after = errors.borrow().len();
-
-                                if item_error_count_after > item_error_count_before {
-                                    // There were errors during this item's deserialization
-                                    // but we still push it to results so we can report all errors
-                                    results.push(partial);
-                                } else {
-                                    results.push(partial);
-                                }
-                            }
+                             /* ~ changed by cargo-mutants ~ */
                             _ => {
                                 // Non-table item in array
                                 errors.borrow_mut().push(AnnotatedError::placed(
                                     span.clone(),
                                     "Expected table in array",
                                     "Only table items are supported in nested struct arrays",
                                 ));
                             }

---- test_nested_happy stdout ----
[toml-pretty-deser/tests/basic.rs:463:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 221..306,
                            msg: "Expected table in array",
                        },

failures:
    test_nested_happy

test result: FAILED. 36 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
