*** toml-pretty-deser/src/lib.rs:1958:53: delete ! in <impl AsNested<Vec<P>> for TomlValue<Vec<toml_edit::Item>>>::as_nested

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete ! in <impl AsNested<Vec<P>> for TomlValue<Vec<toml_edit::Item>>>::as_nested
@@ -1950,17 +1950,17 @@
                                     "Expected table in array",
                                     "Only table items are supported in nested struct arrays",
                                 ));
                             }
                         }
                     }
 
 
-                    if results.iter().any(|partial| !partial.can_concrete()) {
+                    if results.iter().any(|partial|  /* ~ changed by cargo-mutants ~ */partial.can_concrete()) {
                         // There were errors during nested deserialization
                         TomlValue {
                             value: Some(results),
                             required: self.required,
                             state: TomlValueState::ValidationFailed {
                                 span: span.clone(),
                                 message: "Array of nested structs has errors".to_string(),
                             },

---- test_nested_lower_failure stdout ----
[toml-pretty-deser/tests/basic.rs:534:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 117..119,
                            msg: "Wrong type: expected string, found integer",
                        },

failures:
    test_nested_lower_failure

test result: FAILED. 37 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
