*** toml-pretty-deser/src/lib.rs:206:13: delete match arm TomlValueState::Ok{span} in <impl AsEnum<Option<E>> for TomlValue<Option<String>>>::as_enum

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Ok{span} in <impl AsEnum<Option<E>> for TomlValue<Option<String>>>::as_enum
@@ -198,59 +198,17 @@
             },
         }
     }
 }
 
 impl<E: StringNamedEnum> AsEnum<Option<E>> for TomlValue<Option<String>> {
     fn as_enum(self) -> TomlValue<Option<E>> {
         match &self.state {
-            TomlValueState::Ok { span } => {
-                if let Some(ref opt_s) = self.value {
-                    if let Some(s) = opt_s {
-                        match E::from_str(&s) {
-                            Some(enum_val) => TomlValue {
-                                value: Some(Some(enum_val)),
-                                required: self.required,
-                                state: TomlValueState::Ok { span: span.clone() },
-                            },
-                            None => {
-                                let valid_names = E::all_variant_names().join(", ");
-                                TomlValue {
-                                    value: None,
-                                    required: self.required,
-                                    state: TomlValueState::ValidationFailed {
-                                        span: span.clone(),
-                                        message: format!(
-                                            "Invalid enum variant '{}'. Valid variants are: {}",
-                                            s, valid_names
-                                        ),
-                                    },
-                                }
-                            }
-                        }
-                    } else {
-                        // None value is valid for Option<E>
-                        TomlValue {
-                            value: Some(None),
-                            required: self.required,
-                            state: TomlValueState::Ok { span: span.clone() },
-                        }
-                    }
-                } else {
-                    TomlValue {
-                        value: None,
-                        required: self.required,
-                        state: TomlValueState::ValidationFailed {
-                            span: span.clone(),
-                            message: "Cannot convert empty value to enum".to_string(),
-                        },
-                    }
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             TomlValueState::Missing {
                 key: _,
                 parent_span,
             } => TomlValue {
                 value: Some(None),
                 required: self.required,
                 state: TomlValueState::Ok {
                     span: parent_span.clone(),

---- test_enum_happy_path stdout ----

thread 'test_enum_happy_path' (2397001) panicked at toml-pretty-deser/src/lib.rs:1579:53:
called `Option::unwrap()` on a `None` value

---- test_enum_optional_missing stdout ----

thread 'test_enum_optional_missing' (2397004) panicked at toml-pretty-deser/src/lib.rs:1579:53:
called `Option::unwrap()` on a `None` value

failures:
    test_enum_happy_path
    test_enum_optional_missing

test result: FAILED. 36 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
