*** toml-pretty-deser/src/lib.rs:28:9: replace FieldMatchMode::normalize -> String with "xyzzy".into()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace FieldMatchMode::normalize -> String with "xyzzy".into()
@@ -20,21 +20,17 @@
     UpperLower,
     /// Any case variant match (allows camelCase, snake_case, kebab-case, etc.)
     AnyCase,
 }
 
 impl FieldMatchMode {
     /// Normalize a name according to the match mode
     pub fn normalize(&self, name: &str) -> String {
-        match self {
-            FieldMatchMode::Exact => name.to_string(),
-            FieldMatchMode::UpperLower => name.to_lowercase(),
-            FieldMatchMode::AnyCase => normalize_to_no_case(name),
-        }
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if two names match under this mode
     pub fn matches(&self, a: &str, b: &str) -> bool {
         self.normalize(a) == self.normalize(b)
     }
 }

---- tests::test_field_match_mode stdout ----

thread 'tests::test_field_match_mode' (2420885) panicked at toml-pretty-deser/src/lib.rs:122:9:
assertion failed: !exact.matches("field_name", "Field_Name")

failures:
    tests::test_field_match_mode

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
