*** toml-pretty-deser/src/lib.rs:319:13: delete match arm TomlValueState::Missing{key, parent_span} in <impl AsEnum<Vec<E>> for TomlValue<Vec<String>>>::as_enum

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Missing{key, parent_span} in <impl AsEnum<Vec<E>> for TomlValue<Vec<String>>>::as_enum
@@ -311,24 +311,17 @@
                         required: self.required,
                         state: TomlValueState::ValidationFailed {
                             span: span.clone(),
                             message: "Cannot convert empty value to enum".to_string(),
                         },
                     }
                 }
             }
-            TomlValueState::Missing { key, parent_span } => TomlValue {
-                value: None,
-                required: self.required,
-                state: TomlValueState::Missing {
-                    key: key.clone(),
-                    parent_span: parent_span.clone(),
-                },
-            },
+             /* ~ changed by cargo-mutants ~ */
             _ => TomlValue {
                 value: None,
                 required: self.required,
                 state: self.state.clone(),
             },
         }
     }
 }

*** result: Success
