*** toml-pretty-deser/src/lib.rs:339:13: delete match arm TomlValueState::Ok{span} in <impl AsEnum<Option<Vec<E>>> for TomlValue<Option<Vec<String>>>>::as_enum

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm TomlValueState::Ok{span} in <impl AsEnum<Option<Vec<E>>> for TomlValue<Option<Vec<String>>>>::as_enum
@@ -331,73 +331,17 @@
             },
         }
     }
 }
 
 impl<E: StringNamedEnum> AsEnum<Option<Vec<E>>> for TomlValue<Option<Vec<String>>> {
     fn as_enum(self) -> TomlValue<Option<Vec<E>>> {
         match &self.state {
-            TomlValueState::Ok { span } => {
-                if let Some(ref opt_strings) = self.value {
-                    if let Some(strings) = opt_strings {
-                        let mut values = Vec::with_capacity(strings.len());
-                        let mut has_error = false;
-                        let mut error_message = String::new();
-
-                        for s in strings {
-                            match E::from_str(&s) {
-                                Some(enum_val) => values.push(enum_val),
-                                None => {
-                                    has_error = true;
-                                    let valid_names = E::all_variant_names().join(", ");
-                                    error_message = format!(
-                                        "Invalid enum variant '{}'. Valid variants are: {}",
-                                        s, valid_names
-                                    );
-                                    break;
-                                }
-                            }
-                        }
-
-                        if has_error {
-                            TomlValue {
-                                value: None,
-                                required: self.required,
-                                state: TomlValueState::ValidationFailed {
-                                    span: span.clone(),
-                                    message: error_message,
-                                },
-                            }
-                        } else {
-                            TomlValue {
-                                value: Some(Some(values)),
-                                required: self.required,
-                                state: TomlValueState::Ok { span: span.clone() },
-                            }
-                        }
-                    } else {
-                        // None value is valid for Option<Vec<E>>
-                        TomlValue {
-                            value: Some(None),
-                            required: self.required,
-                            state: TomlValueState::Ok { span: span.clone() },
-                        }
-                    }
-                } else {
-                    TomlValue {
-                        value: None,
-                        required: self.required,
-                        state: TomlValueState::ValidationFailed {
-                            span: span.clone(),
-                            message: "Cannot convert empty value to enum".to_string(),
-                        },
-                    }
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             TomlValueState::Missing {
                 key: _,
                 parent_span,
             } => TomlValue {
                 value: Some(None),
                 required: self.required,
                 state: TomlValueState::Ok {
                     span: parent_span.clone(),

---- test_enum_happy_path stdout ----

thread 'test_enum_happy_path' (2424154) panicked at toml-pretty-deser/src/lib.rs:1565:53:
called `Option::unwrap()` on a `None` value

---- test_enum_optional_missing stdout ----

thread 'test_enum_optional_missing' (2424157) panicked at toml-pretty-deser/src/lib.rs:1565:53:
called `Option::unwrap()` on a `None` value

failures:
    test_enum_happy_path
    test_enum_optional_missing

test result: FAILED. 36 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
