*** toml-pretty-deser/src/lib.rs:37:9: replace FieldMatchMode::matches -> bool with false

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace FieldMatchMode::matches -> bool with false
@@ -29,17 +29,17 @@
             FieldMatchMode::Exact => name.to_string(),
             FieldMatchMode::UpperLower => name.to_lowercase(),
             FieldMatchMode::AnyCase => normalize_to_no_case(name),
         }
     }
 
     /// Check if two names match under this mode
     pub fn matches(&self, a: &str, b: &str) -> bool {
-        self.normalize(a) == self.normalize(b)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Convert any case variant to snake_case for comparison
 /// Supports: camelCase, UpperCamelCase, snake_case, kebab-case, SHOUTY_SNAKE_CASE, Train-Case
 pub fn normalize_to_no_case(s: &str) -> String {
     s.chars()
         .filter_map(|c| match c {

---- tests::test_field_match_mode stdout ----

thread 'tests::test_field_match_mode' (2383192) panicked at toml-pretty-deser/src/lib.rs:125:9:
assertion failed: exact.matches("field_name", "field_name")

failures:
    tests::test_field_match_mode

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
