*** toml-pretty-deser/src/lib.rs:44:5: replace normalize_to_no_case -> String with "xyzzy".into()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace normalize_to_no_case -> String with "xyzzy".into()
@@ -36,23 +36,17 @@
     pub fn matches(&self, a: &str, b: &str) -> bool {
         self.normalize(a) == self.normalize(b)
     }
 }
 
 /// Convert any case variant to snake_case for comparison
 /// Supports: camelCase, UpperCamelCase, snake_case, kebab-case, SHOUTY_SNAKE_CASE, Train-Case
 pub fn normalize_to_no_case(s: &str) -> String {
-    s.chars()
-        .filter_map(|c| match c {
-            'A'..='Z' => Some(c.to_lowercase().next().unwrap()),
-            'a'..='z' | '0'..='9' => Some(c),
-            _ => None,
-        })
-        .collect()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     // let mut result = String::with_capacity(s.len() * 2);
     // let mut chars = s.chars().peekable();
     // let mut prev_was_uppercase = false;
     // let mut prev_was_separator = true;
     //
     // while let Some(c) = chars.next() {
     //     if c == '-' || c == '_' {
     //         if !prev_was_separator {

---- tests::test_normalize_no_case stdout ----

thread 'tests::test_normalize_no_case' (2401213) panicked at toml-pretty-deser/src/lib.rs:101:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "snakecase"

failures:
    tests::test_normalize_no_case

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
