*** toml-pretty-deser/src/lib.rs:456:5: replace suggest_alternatives -> String with "xyzzy".into()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace suggest_alternatives -> String with "xyzzy".into()
@@ -448,40 +448,17 @@
         Err(DeserError::StillIncomplete(
             helper.into_inner(&source),
             partial,
         ))
     }
 }
 
 fn suggest_alternatives<T: AsRef<str>>(current: &str, available: &[T]) -> String {
-    if current.is_empty() {
-        let mut sorted: Vec<&str> = available.iter().map(AsRef::as_ref).collect::<Vec<&str>>();
-        sorted.sort_unstable();
-        return format!("Available are: {}", format_quoted_list(&sorted));
-    }
-
-    let mut distances: Vec<(usize, &str)> = available
-        .iter()
-        .map(|item| {
-            let item_str = item.as_ref();
-            let dist = strsim::levenshtein(current, item_str);
-            (dist, item_str)
-        })
-        .collect();
-
-    distances.sort_by_key(|k| k.0);
-
-    let closest: Vec<&str> = distances.into_iter().take(3).map(|(_, s)| s).collect();
-
-    if closest.is_empty() {
-        "All known keys have been used.".to_string()
-    } else {
-        format!("Did you mean: {}?", format_quoted_list(&closest))
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn format_quoted_list(items: &[&str]) -> String {
     match items {
         [] => String::new(),
         [single] => format!("'{}'", single),
         [first, second] => format!("'{}' or '{}'", first, second),
         rest => {

---- test_two_errors_pretty stdout ----
[toml-pretty-deser/tests/basic.rs:739:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [level1]\n            name = 'l1'\n\n        [level1.level2]\n            other = 2\n            # missing data field\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 79..84,
                            msg: "Unknown key: other",
                        },

failures:
    test_two_errors_pretty

test result: FAILED. 37 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
