*** toml-pretty-deser/src/lib.rs:47:13: delete match arm 'a'..= 'z' | '0'..= '9' in normalize_to_no_case

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm 'a'..= 'z' | '0'..= '9' in normalize_to_no_case
@@ -39,17 +39,17 @@
 }
 
 /// Convert any case variant to snake_case for comparison
 /// Supports: camelCase, UpperCamelCase, snake_case, kebab-case, SHOUTY_SNAKE_CASE, Train-Case
 pub fn normalize_to_no_case(s: &str) -> String {
     s.chars()
         .filter_map(|c| match c {
             'A'..='Z' => Some(c.to_lowercase().next().unwrap()),
-            'a'..='z' | '0'..='9' => Some(c),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         })
         .collect()
     // let mut result = String::with_capacity(s.len() * 2);
     // let mut chars = s.chars().peekable();
     // let mut prev_was_uppercase = false;
     // let mut prev_was_separator = true;
     //

---- tests::test_normalize_no_case stdout ----

thread 'tests::test_normalize_no_case' (2402539) panicked at toml-pretty-deser/src/lib.rs:107:9:
assertion `left == right` failed
  left: ""
 right: "snakecase"

---- tests::test_field_match_mode stdout ----

thread 'tests::test_field_match_mode' (2402538) panicked at toml-pretty-deser/src/lib.rs:137:9:
assertion failed: any_case.matches("field_name", "fieldName")

failures:
    tests::test_field_match_mode
    tests::test_normalize_no_case

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
