*** toml-pretty-deser/src/lib.rs:483:5: replace format_quoted_list -> String with "xyzzy".into()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace format_quoted_list -> String with "xyzzy".into()
@@ -475,30 +475,17 @@
     if closest.is_empty() {
         "All known keys have been used.".to_string()
     } else {
         format!("Did you mean: {}?", format_quoted_list(&closest))
     }
 }
 
 fn format_quoted_list(items: &[&str]) -> String {
-    match items {
-        [] => String::new(),
-        [single] => format!("'{}'", single),
-        [first, second] => format!("'{}' or '{}'", first, second),
-        rest => {
-            let (last, init) = rest.split_last().expect("can't fail");
-            let start = init
-                .iter()
-                .map(|s| format!("'{}'", s))
-                .collect::<Vec<_>>()
-                .join(", ");
-            format!("{}, or '{}'", start, last)
-        }
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug)]
 pub enum DeserError<P> {
     ParsingFailure(TomlError),
     DeserFailure(Vec<HydratedAnnotatedError>, P),
     StillIncomplete(Vec<HydratedAnnotatedError>, P),
 }

---- test_two_errors_pretty stdout ----
[toml-pretty-deser/tests/basic.rs:739:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [level1]\n            name = 'l1'\n\n        [level1.level2]\n            other = 2\n            # missing data field\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 79..84,
                            msg: "Unknown key: other",
                        },

failures:
    test_two_errors_pretty

test result: FAILED. 37 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
