*** toml-pretty-deser/src/lib.rs:522:9: replace <impl std::error::Error for DeserError<P>>::source -> Option<&(dyn std::error::Error +'static)> with None

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace <impl std::error::Error for DeserError<P>>::source -> Option<&(dyn std::error::Error +'static)> with None
@@ -514,20 +514,17 @@
                 write!(f, "Incomplete deserialization with {} errors", errors.len())
             }
         }
     }
 }
 
 impl<P: std::fmt::Debug> std::error::Error for DeserError<P> {
     fn source(&self) -> Option<&(dyn std::error::Error + 'static)> {
-        match self {
-            DeserError::ParsingFailure(e) => Some(e),
-            _ => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<P> From<TomlError> for DeserError<P> {
     fn from(value: TomlError) -> Self {
         DeserError::ParsingFailure(value)
     }
 }

*** result: Success
