*** toml-pretty-deser/src/lib.rs:623:12: delete ! in HydratedAnnotatedError::pretty

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete ! in HydratedAnnotatedError::pretty
@@ -615,17 +615,17 @@
 impl HydratedAnnotatedError {
     pub fn pretty(&self, source_name: &str) -> String {
         use bstr::{BStr, ByteSlice};
         use codesnake::{Block, CodeWidth, Label, LineIndex};
         use std::fmt::Write;
 
         let source = self.source.borrow();
 
-        if !self.inner.spans.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */self.inner.spans.is_empty() {
             let idx = LineIndex::new(&source);
             let mut spans = self.inner.spans.clone();
             spans.sort_by_key(|span| span.span.start);
 
             let mut previous_newline =
                 memchr::memmem::rfind(&source.as_bytes()[..spans[0].span.start], b"\n");
             let this_line_is_block_start = source.as_bytes()[previous_newline.unwrap_or(0)..]
                 .trim_ascii_start()

---- test_two_errors_pretty stdout ----
[toml-pretty-deser/tests/basic.rs:669:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [level1]\n            name = 'l1'\n\n        [level1.level2]\n            other = 2\n            # missing data field\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 79..84,
                            msg: "Unknown key: other",
                        },

failures:
    test_two_errors_pretty

test result: FAILED. 36 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
