*** toml-pretty-deser/src/lib.rs:677:33: delete ! in HydratedAnnotatedError::pretty

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete ! in HydratedAnnotatedError::pretty
@@ -669,17 +669,17 @@
                         .enumerate()
                         .map(|(line_no, line)| (line_no, line))
                         .rev()
                         .take_while(move |x| {
                             if BStr::new(x.1).trim_ascii_start().starts_with(b"[") {
                                 seen_opening = true;
                                 true
                             } else {
-                                !seen_opening
+                                 /* ~ changed by cargo-mutants ~ */seen_opening
                             }
                         })
                         .map(|(line_no, line)| {
                             format!(
                                 "{:>digits_needed$} │ {}",
                                 line_no + 1,
                                 std::string::String::from_utf8_lossy(line)
                             )

---- test_two_errors_pretty stdout ----
[toml-pretty-deser/tests/basic.rs:739:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [level1]\n            name = 'l1'\n\n        [level1.level2]\n            other = 2\n            # missing data field\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 79..84,
                            msg: "Unknown key: other",
                        },

failures:
    test_two_errors_pretty

test result: FAILED. 37 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
