*** toml-pretty-deser/src/lib.rs:759:9: replace FieldInfo::all_normalized_names -> Vec<String> with vec![]

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace FieldInfo::all_normalized_names -> Vec<String> with vec![]
@@ -751,21 +751,17 @@
 
     pub fn with_aliases(mut self, aliases: &Vec<&'static str>) -> Self {
         self.aliases.extend(aliases);
         self
     }
 
     /// Get all normalized names for this field (primary name + aliases)
     pub fn all_normalized_names(&self, mode: &FieldMatchMode) -> Vec<String> {
-        let mut names = vec![mode.normalize(&self.name)];
-        for alias in &self.aliases {
-            names.push(mode.normalize(alias));
-        }
-        names
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub struct TomlHelper<'a> {
     table: Option<&'a toml_edit::Table>,
     inline_table: Option<&'a toml_edit::InlineTable>,
     /// Expected field info (what we allow to see)
     expected: Vec<FieldInfo>,

---- test_two_errors_pretty stdout ----
[toml-pretty-deser/tests/basic.rs:669:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [level1]\n            name = 'l1'\n\n        [level1.level2]\n            other = 2\n            # missing data field\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 79..84,
                            msg: "Unknown key: other",
                        },

failures:
    test_two_errors_pretty

test result: FAILED. 36 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
