*** toml-pretty-deser/src/lib.rs:814:9: replace TomlHelper<'a>::with_match_mode with ()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlHelper<'a>::with_match_mode with ()
@@ -806,17 +806,17 @@
             observed: vec![],
             allowed: HashMap::new(),
             errors,
             match_mode,
         }
     }
 
     pub fn with_match_mode(&mut self, mode: FieldMatchMode) {
-        self.match_mode = mode;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn into_inner(self, source: &Rc<RefCell<String>>) -> Vec<HydratedAnnotatedError> {
         self.errors
             .borrow_mut()
             .drain(..)
             .map(|error| HydratedAnnotatedError {
                 source: source.clone(),

*** result: Success
