*** toml-pretty-deser/src/lib.rs:818:9: replace TomlHelper<'a>::into_inner -> Vec<HydratedAnnotatedError> with vec![]

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlHelper<'a>::into_inner -> Vec<HydratedAnnotatedError> with vec![]
@@ -810,24 +810,17 @@
         }
     }
 
     pub fn with_match_mode(&mut self, mode: FieldMatchMode) {
         self.match_mode = mode;
     }
 
     pub fn into_inner(self, source: &Rc<RefCell<String>>) -> Vec<HydratedAnnotatedError> {
-        self.errors
-            .borrow_mut()
-            .drain(..)
-            .map(|error| HydratedAnnotatedError {
-                source: source.clone(),
-                inner: error,
-            })
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Register a field with optional aliases
     pub fn expect_field(&mut self, name: impl Into<String>, aliases: &Vec<&'static str>) {
         let field_info = FieldInfo::new(name).with_aliases(aliases);
         self.expected.push(field_info);
     }

---- test_alias_exact_mode_failure stdout ----

thread 'test_alias_exact_mode_failure' (2340854) panicked at toml-pretty-deser/tests/basic.rs:738:9:
assertion failed: errors.len() >= 1

---- test_any_case_mode_unknown_key stdout ----

thread 'test_any_case_mode_unknown_key' (2340861) panicked at toml-pretty-deser/tests/basic.rs:889:9:
assertion failed: errors.iter().any(|e| e.inner.spans[0].msg.contains("unknown_field"))

---- test_array_wrong_element_type stdout ----
[toml-pretty-deser/tests/basic.rs:301:5] &result = Err(
    DeserFailure(
        [],
        PartialComplexOutput {
            items: TomlValue {
                value: None,
                state: ValidationFailed {
                    span: 21..30,
                    message: "Array contains invalid elements",
                },
                required: true,
            },
            numbers: TomlValue {

failures:
    test_alias_exact_mode_failure
    test_any_case_mode_unknown_key
    test_array_wrong_element_type
    test_enum_invalid_variant
    test_enum_missing_required
    test_missing
    test_nested_happy_half
    test_range_validation
    test_two_errors_pretty
    test_two_level_nested_missing_inner_field
    test_validation_failure
    test_vec_missing

test result: FAILED. 24 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
