*** toml-pretty-deser/src/lib.rs:830:9: replace TomlHelper<'a>::expect_field with ()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlHelper<'a>::expect_field with ()
@@ -822,18 +822,17 @@
                 source: source.clone(),
                 inner: error,
             })
             .collect()
     }
 
     /// Register a field with optional aliases
     pub fn expect_field(&mut self, name: impl Into<String>, aliases: &Vec<&'static str>) {
-        let field_info = FieldInfo::new(name).with_aliases(aliases);
-        self.expected.push(field_info);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Find a key in the table that matches the given field name (considering aliases and match mode)
     fn find_matching_keys(
         &self,
         name: &str,
         aliases: &[&'static str],
     ) -> Vec<(String, toml_edit::Item)> {

---- test_two_errors_pretty stdout ----
[toml-pretty-deser/tests/basic.rs:739:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [level1]\n            name = 'l1'\n\n        [level1.level2]\n            other = 2\n            # missing data field\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 79..84,
                            msg: "Unknown key: other",
                        },

failures:
    test_two_errors_pretty

test result: FAILED. 37 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
