*** toml-pretty-deser/src/lib.rs:840:9: replace TomlHelper<'a>::find_matching_keys -> Vec<(String, toml_edit::Item)> with vec![(String::new(), Default::default())]

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlHelper<'a>::find_matching_keys -> Vec<(String, toml_edit::Item)> with vec![(String::new(), Default::default())]
@@ -832,51 +832,17 @@
     }
 
     /// Find a key in the table that matches the given field name (considering aliases and match mode)
     fn find_matching_keys(
         &self,
         name: &str,
         aliases: &[&'static str],
     ) -> Vec<(String, toml_edit::Item)> {
-        let mut result = Vec::new();
-        let _normalized_target = self.match_mode.normalize(name);
-        let candidates = std::iter::once(name.to_string())
-            .chain(aliases.iter().map(|x| x.to_string()))
-            .collect::<Vec<_>>();
-
-        // Collect all table keys
-        let table_keys: Vec<String> = if let Some(table) = self.table {
-            table.iter().map(|(k, _)| k.to_string()).collect()
-        } else if let Some(inline_table) = self.inline_table {
-            inline_table.iter().map(|(k, _)| k.to_string()).collect()
-        } else {
-            vec![]
-        };
-
-        // Try to find a match
-        for table_key in &table_keys {
-            for candidate in &candidates {
-                if self.match_mode.matches(candidate, table_key) {
-                    if let Some(table) = self.table {
-                        if let Some(item) = table.get(table_key) {
-                            result.push((table_key.clone(), item.clone()));
-                            break;
-                        }
-                    } else if let Some(inline_table) = self.inline_table {
-                        if let Some(value) = inline_table.get(table_key) {
-                            result.push((table_key.clone(), toml_edit::Item::Value(value.clone())));
-                            break;
-                        }
-                    }
-                }
-            }
-        }
-
-        result
+        vec![(String::new(), Default::default())] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get<T>(&mut self, key: &str) -> TomlValue<T>
     where
         TomlValue<T>: FromTomlItem,
         T: std::fmt::Debug,
     {
         self.get_with_aliases(key, vec![])

---- test_alias_exact_mode stdout ----
[toml-pretty-deser/tests/basic.rs:715:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        alsoAName = 'using alias'\n        myValue = 42\n        regular_field = 'no alias'\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..18,
                            msg: "Unknown key: alsoAName",
                        },

---- test_alias_with_any_case_mode stdout ----
[toml-pretty-deser/tests/basic.rs:906:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        myName = 'alias match'\n        myValue = 111\n        regularField = 'case variant'\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..15,
                            msg: "Unknown key: myName",
                        },

---- test_any_case_mode_kebab stdout ----
[toml-pretty-deser/tests/basic.rs:814:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        my-field = 'kebab case'\n        another-field = 101\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..17,
                            msg: "Unknown key: my-field",
                        },

failures:
    test_alias_exact_mode
    test_alias_with_any_case_mode
    test_any_case_mode_camel
    test_any_case_mode_kebab
    test_any_case_mode_shouty
    test_any_case_mode_snake
    test_any_case_mode_train
    test_any_case_mode_upper_camel
    test_arrays_and_nested
    test_arrays_with_optional
    test_complex_mixed_case
    test_complex_mixed_case_key_reused

test result: FAILED. 3 passed; 34 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
