*** toml-pretty-deser/src/lib.rs:882:9: replace TomlHelper<'a>::get -> TomlValue<T> with TomlValue::from(Default::default())

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlHelper<'a>::get -> TomlValue<T> with TomlValue::from(Default::default())
@@ -874,17 +874,17 @@
         result
     }
 
     pub fn get<T>(&mut self, key: &str) -> TomlValue<T>
     where
         TomlValue<T>: FromTomlItem,
         T: std::fmt::Debug,
     {
-        self.get_with_aliases(key, vec![])
+        TomlValue::from(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get_with_aliases<T>(
         &mut self,
         query_key: &str,
         aliases: Vec<&'static str>,
     ) -> TomlValue<T>
     where

---- test_alias_exact_mode stdout ----
[toml-pretty-deser/tests/basic.rs:787:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        alsoAName = 'using alias'\n        myValue = 42\n        regular_field = 'no alias'\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 64..77,
                            msg: "Unknown key: regular_field",
                        },

---- test_alias_with_any_case_mode stdout ----
[toml-pretty-deser/tests/basic.rs:980:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        myName = 'alias match'\n        myValue = 111\n        regularField = 'case variant'\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 62..74,
                            msg: "Unknown key: regularField",
                        },

---- test_any_case_mode_kebab stdout ----
[toml-pretty-deser/tests/basic.rs:886:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        my-field = 'kebab case'\n        another-field = 101\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..17,
                            msg: "Unknown key: my-field",
                        },

failures:
    test_alias_exact_mode
    test_alias_with_any_case_mode
    test_any_case_mode_camel
    test_any_case_mode_kebab
    test_any_case_mode_shouty
    test_any_case_mode_snake
    test_any_case_mode_train
    test_any_case_mode_upper_camel
    test_arrays
    test_arrays_with_optional
    test_complex_mixed_case
    test_complex_mixed_case_key_reused

test result: FAILED. 5 passed; 33 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
