*** toml-pretty-deser/src/lib.rs:894:9: replace TomlHelper<'a>::get_with_aliases -> TomlValue<T> with TomlValue::from(Default::default())

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlHelper<'a>::get_with_aliases -> TomlValue<T> with TomlValue::from(Default::default())
@@ -886,75 +886,17 @@
         &mut self,
         query_key: &str,
         aliases: Vec<&'static str>,
     ) -> TomlValue<T>
     where
         TomlValue<T>: FromTomlItem,
         T: std::fmt::Debug,
     {
-        let parent_span = if let Some(table) = self.table {
-            table.span().unwrap_or(0..0)
-        } else if let Some(inline_table) = self.inline_table {
-            inline_table.span().unwrap_or(0..0)
-        } else {
-            0..0
-        };
-
-        // Register this field as expected
-        self.expect_field(query_key, &aliases);
-
-        // Try to find a matching key (considering aliases and match mode)
-        let found_keys = self.find_matching_keys(query_key, &aliases);
-
-        match found_keys.len() {
-            0 => {
-                // No match found
-                let mut res: TomlValue<T> = //todo: refactor into new_empty_missing...
-                    FromTomlItem::from_toml_item(&toml_edit::Item::None, parent_span.clone());
-                if let TomlValueState::Missing { ref mut key, .. } = res.state {
-                    if key.is_empty() {
-                        *key = query_key.to_string().clone();
-                    }
-                }
-                res
-            }
-            1 => {
-                let (matched_key, item) = found_keys.iter().next().unwrap();
-                let res: TomlValue<T> = FromTomlItem::from_toml_item(&item, parent_span);
-                self.observed.push(self.match_mode.normalize(&matched_key));
-                res
-            }
-            _ => {
-                let spans = found_keys
-                    .iter()
-                    .map(|(_matched_key, item)| item.span().unwrap_or(0..0))
-                    .collect();
-
-                let mut res: TomlValue<T> =
-                    FromTomlItem::from_toml_item(&toml_edit::Item::None, parent_span);
-                res.state = TomlValueState::MultiDefined {
-                    key: query_key.to_string(),
-                    spans,
-                };
-                res
-                // let res = TomlValue<T> =
-                // let iter = found_keys.iter();
-                // let first = iter.next().unwrap();
-                // let first_span = first[1].span().unwrap_or(0..0);
-                // let mut err = AnnotatedError::placed(
-                //     first_span,
-                //     &format!("Key/alias conflict with key."),
-                //     "Use only one of the keys involved",
-                // );
-                // for (_matched_key, item) in iter {
-                //     err.add_span(item.span().unwrap_or(0..0), "Also defined here");
-                // }
-            }
-        }
+        TomlValue::from(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn add_err(&self, err: AnnotatedError) {
         self.errors.borrow_mut().push(err);
     }
 
     fn span_from_key(&self, key: &str) -> Range<usize> {
         if let Some(table) = self.table {

---- test_any_case_mode_kebab stdout ----
[toml-pretty-deser/tests/basic.rs:886:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        my-field = 'kebab case'\n        another-field = 101\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..17,
                            msg: "Unknown key: my-field",
                        },

---- test_alias_with_any_case_mode stdout ----
[toml-pretty-deser/tests/basic.rs:980:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        myName = 'alias match'\n        myValue = 111\n        regularField = 'case variant'\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..15,
                            msg: "Unknown key: myName",
                        },

---- test_any_case_mode_camel stdout ----
[toml-pretty-deser/tests/basic.rs:868:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        myField = 'camel case'\n        anotherField = 789\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..16,
                            msg: "Unknown key: myField",
                        },

failures:
    test_alias_exact_mode
    test_alias_with_any_case_mode
    test_any_case_mode_camel
    test_any_case_mode_kebab
    test_any_case_mode_shouty
    test_any_case_mode_snake
    test_any_case_mode_train
    test_any_case_mode_upper_camel
    test_arrays
    test_arrays_with_optional
    test_complex_mixed_case
    test_complex_mixed_case_key_reused

test result: FAILED. 3 passed; 35 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
