*** toml-pretty-deser/src/lib.rs:920:13: delete match arm 1 in TomlHelper<'a>::get_with_aliases

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ delete match arm 1 in TomlHelper<'a>::get_with_aliases
@@ -912,22 +912,17 @@
                     FromTomlItem::from_toml_item(&toml_edit::Item::None, parent_span.clone());
                 if let TomlValueState::Missing { ref mut key, .. } = res.state {
                     if key.is_empty() {
                         *key = query_key.to_string().clone();
                     }
                 }
                 res
             }
-            1 => {
-                let (matched_key, item) = found_keys.iter().next().unwrap();
-                let res: TomlValue<T> = FromTomlItem::from_toml_item(&item, parent_span);
-                self.observed.push(self.match_mode.normalize(&matched_key));
-                res
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {
                 let spans = found_keys
                     .iter()
                     .map(|(_matched_key, item)| item.span().unwrap_or(0..0))
                     .collect();
 
                 let mut res: TomlValue<T> =
                     FromTomlItem::from_toml_item(&toml_edit::Item::None, parent_span);

---- test_any_case_mode_camel stdout ----
[toml-pretty-deser/tests/basic.rs:868:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        myField = 'camel case'\n        anotherField = 789\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..16,
                            msg: "Unknown key: myField",
                        },

---- test_any_case_mode_shouty stdout ----
[toml-pretty-deser/tests/basic.rs:922:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        MY_FIELD = 'shouty'\n        ANOTHER_FIELD = 303\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..17,
                            msg: "Unknown key: MY_FIELD",
                        },

---- test_any_case_mode_train stdout ----
[toml-pretty-deser/tests/basic.rs:940:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        My-Field = 'train case'\n        Another-Field = 404\n    ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 9..17,
                            msg: "Unknown key: My-Field",
                        },

failures:
    test_alias_exact_mode
    test_alias_with_any_case_mode
    test_any_case_mode_camel
    test_any_case_mode_kebab
    test_any_case_mode_shouty
    test_any_case_mode_snake
    test_any_case_mode_train
    test_any_case_mode_upper_camel
    test_arrays
    test_arrays_with_optional
    test_complex_mixed_case
    test_complex_mixed_case_key_reused

test result: FAILED. 5 passed; 33 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
