*** toml-pretty-deser/src/lib.rs:952:9: replace TomlHelper<'a>::add_err with ()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlHelper<'a>::add_err with ()
@@ -944,17 +944,17 @@
                 // for (_matched_key, item) in iter {
                 //     err.add_span(item.span().unwrap_or(0..0), "Also defined here");
                 // }
             }
         }
     }
 
     pub fn add_err(&self, err: AnnotatedError) {
-        self.errors.borrow_mut().push(err);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn span_from_key(&self, key: &str) -> Range<usize> {
         if let Some(table) = self.table {
             table.key(key).and_then(|item| item.span()).unwrap_or(0..0)
         } else if let Some(inline_table) = self.inline_table {
             // For inline tables, we can't easily get the key span, so use the table span
             inline_table.span().unwrap_or(0..0)

*** result: Success
