*** toml-pretty-deser/src/lib.rs:971:9: replace TomlHelper<'a>::add_err_by_key with ()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlHelper<'a>::add_err_by_key with ()
@@ -963,18 +963,17 @@
             // For inline tables, we can't easily get the key span, so use the table span
             inline_table.span().unwrap_or(0..0)
         } else {
             0..0
         }
     }
 
     pub fn add_err_by_key(&self, key: &str, msg: &str, help: &str) {
-        let span = self.span_from_key(key);
-        self.add_err_by_span(span, msg, help);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn add_err_by_span(&self, span: Range<usize>, msg: &str, help: &str) {
         let err = AnnotatedError::placed(span.clone(), msg, help);
         self.errors.borrow_mut().push(err);
     }
 
     pub fn deny_unknown(&self) {

---- test_any_case_mode_unknown_key stdout ----

thread 'test_any_case_mode_unknown_key' (2406956) panicked at toml-pretty-deser/tests/basic.rs:961:9:
assertion failed: errors.iter().any(|e| e.inner.spans[0].msg.contains("unknown_field"))

---- test_two_errors_pretty stdout ----
[toml-pretty-deser/tests/basic.rs:739:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [level1]\n            name = 'l1'\n\n        [level1.level2]\n            other = 2\n            # missing data field\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 51..66,
                            msg: "Missing required key: data",
                        },

failures:
    test_any_case_mode_unknown_key
    test_two_errors_pretty

test result: FAILED. 36 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
