*** toml-pretty-deser/src/lib.rs:972:9: replace TomlHelper<'a>::add_err_by_span with ()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlHelper<'a>::add_err_by_span with ()
@@ -964,18 +964,17 @@
     }
 
     pub fn add_err_by_key(&self, key: &str, msg: &str, help: &str) {
         let span = self.span_from_key(key);
         self.add_err_by_span(span, msg, help);
     }
 
     pub fn add_err_by_span(&self, span: Range<usize>, msg: &str, help: &str) {
-        let err = AnnotatedError::placed(span.clone(), msg, help);
-        self.errors.borrow_mut().push(err);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn deny_unknown(&self) {
         // Build set of normalized expected names (including aliases)
         let mut expected_normalized: HashSet<String> = HashSet::new();
         for field_info in &self.expected {
             for normalized_name in field_info.all_normalized_names(&self.match_mode) {
                 expected_normalized.insert(normalized_name);

---- test_any_case_mode_unknown_key stdout ----

thread 'test_any_case_mode_unknown_key' (2377924) panicked at toml-pretty-deser/tests/basic.rs:889:9:
assertion failed: errors.iter().any(|e| e.inner.spans[0].msg.contains("unknown_field"))

---- test_two_errors_pretty stdout ----
[toml-pretty-deser/tests/basic.rs:669:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [level1]\n            name = 'l1'\n\n        [level1.level2]\n            other = 2\n            # missing data field\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 51..66,
                            msg: "Missing required key: data",
                        },

failures:
    test_any_case_mode_unknown_key
    test_two_errors_pretty

test result: FAILED. 35 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
