*** toml-pretty-deser/src/lib.rs:982:9: replace TomlHelper<'a>::deny_unknown with ()

*** mutation diff:
--- toml-pretty-deser/src/lib.rs
+++ replace TomlHelper<'a>::deny_unknown with ()
@@ -974,54 +974,17 @@
 
     pub fn add_err_by_span(&self, span: Range<usize>, msg: &str, help: &str) {
         let err = AnnotatedError::placed(span.clone(), msg, help);
         self.errors.borrow_mut().push(err);
     }
 
     pub fn deny_unknown(&self) {
         // Build set of normalized expected names (including aliases)
-        let mut expected_normalized: HashSet<String> = HashSet::new();
-        for field_info in &self.expected {
-            for normalized_name in field_info.all_normalized_names(&self.match_mode) {
-                expected_normalized.insert(normalized_name);
-            }
-        }
-
-        // Collect all keys from either table type
-        let keys: Vec<String> = if let Some(table) = self.table {
-            table.iter().map(|(k, _)| k.to_string()).collect()
-        } else if let Some(inline_table) = self.inline_table {
-            inline_table.iter().map(|(k, _)| k.to_string()).collect()
-        } else {
-            vec![]
-        };
-
-        // Build set of observed normalized names
-        let observed_set: HashSet<String> = self.observed.iter().cloned().collect();
-
-        for key in keys {
-            let normalized_key = self.match_mode.normalize(&key);
-
-            // Check if this key was observed (i.e., it matched an expected field)
-            if !observed_set.contains(&normalized_key) {
-                // This is an unknown key - find available (expected but not yet observed) fields
-                let still_available: Vec<_> = expected_normalized
-                    .iter()
-                    .filter(|expected| !observed_set.contains(*expected))
-                    .map(|s| s.as_str())
-                    .collect();
-
-                self.add_err_by_key(
-                    &key,
-                    &format!("Unknown key: {}", key),
-                    &suggest_alternatives(&key, &still_available),
-                );
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub trait FromTomlItem {
     fn is_optional() -> bool;
     fn from_toml_item(item: &toml_edit::Item, parent_span: Range<usize>) -> Self;
 }

---- test_any_case_mode_unknown_key stdout ----

thread 'test_any_case_mode_unknown_key' (2415462) panicked at toml-pretty-deser/tests/basic.rs:961:9:
assertion failed: errors.iter().any(|e| e.inner.spans[0].msg.contains("unknown_field"))

---- test_two_errors_pretty stdout ----
[toml-pretty-deser/tests/basic.rs:739:5] &result = Err(
    DeserFailure(
        [
            HydratedAnnotatedError {
                source: RefCell {
                    value: "\n        [level1]\n            name = 'l1'\n\n        [level1.level2]\n            other = 2\n            # missing data field\n        ",
                },
                inner: AnnotatedError {
                    spans: [
                        SpannedMessage {
                            span: 51..66,
                            msg: "Missing required key: data",
                        },

failures:
    test_any_case_mode_unknown_key
    test_two_errors_pretty

test result: FAILED. 36 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
